@echo off
chcp 1255
set /p path_cd="PATH:>>>"
cd /d %path_cd%
set "is_file=%0%"
path "C:\Users\משתמש\Desktop\ניסויים 2.5\קבצי באט שיצרתי\תוכנות באט ופייתון\מערכת הקבצים\מסדר הסינגלים\מסדר הסינגלים 2022\גרסאות מתקדמות\MediaInfo_CLI_22.06_Windows_x64";%path%

for %%s in (*.mp3) do (
set file=%%~s
call :func
)
del "%Temp%\artist-song.tmp"
del "%Temp%\artist-song-ansi.tmp"
pause
exit

:func
:: שימוש בתוכנה חיצונית להכנסת נתוני השיר לקובץ
::חיפוש שורה המכילה את שם האמן בתוך הקובץ
:: והכנסת השורה לקובץ
mediainfo "%file%" | findstr /b "Performer">"%Temp%\artist-song.tmp"
::המרת קובץ הפלט לפורמט אנסי התואם לבאט
powershell "(Get-Content "%Temp%\artist-song.tmp" -Encoding utf8 | Out-File "%Temp%\artist-song-ansi.tmp" -Encoding default)"

:: העברת תוכן הקובץ למשתנה
set/p artist=<"%Temp%\artist-song-ansi.tmp"
::יציאה מהפונקציה במקרה והמשתנה ריק
if "%artist%"=="" exit /b
::במקרה ולא:
::הסרת תוכן מהקובץ והשארת שם האמן בלבד
set "artist=%artist:~43%"
::חיפוש שם האמן בתוך הקובץ הנוכחי
::אם הוא קיים מתבצעת העברה של השיר
::לתוך תיקיה המוגדרת כשם האמן
find /c "%artist%" %is_file%>nul
if %errorlevel%==0 (
md "מסודר\%artist%"
copy "%file%" "מסודר\%artist%"
)
::יציאה מהפונקציה וחזרה לפקודת הפור
exit /b




REM אבי מילר
REM אביתר בנאי
REM אברהם פריד
REM אברומי ויינברג
REM אבריימי רוט
REM אהרל'ה סמט
REM אהרלה וינטרוב
REM אהרן רזאל
REM אודי אולמן
REM אודי דוידי
REM אוהד מושקוביץ
REM אורי דוידי
REM אידיש נחת
REM אייזיק האניג
REM איציק אשל
REM איציק דדיה
REM אלי הרצליך
REM אלי מרכוס
REM אלי פרידמן
REM אפרים מנדלסון
REM ארי גולדוואג
REM ארי רייך
REM ביני לנדאו
REM בן ציון שנקר
REM בני פרידמן
REM בנצי שטיין
REM בערי וועבר
REM ברוך לוין
REM ברוך נפתל
REM ברוך שלום
REM גד אלבז
REM דב הנדלר
REM דדי גראוכר
REM דוד לואי
REM דוד שמחה
REM דודו פישר
REM דודי קאליש
REM דודי קנאפלער
REM האסק
REM הלל פלאי
REM המזמרים
REM המנגנים
REM הערשי וייס
REM ווקאלי
REM זאנוויל ויינברגר
REM זושא
REM חיים ישראל
REM חיים שלמה מאייעס
REM חיליק פראנק
REM חנן בן ארי
REM יהודה גלאנץ
REM יהודה גרין
REM יהודה דים
REM יואלי גרינפלד
REM יואלי דיקמן
REM יואלי פלקוביץ
REM יואלי קליין
REM יומי לואי
REM יונגערליך
REM יוני זיגלבוים
REM יונתן רזאל
REM יונתן שיינפלד
REM יוסי גרין
REM יוסף חיים שוואקי
REM יוסף משה כהנא
REM יוסף קרדונר
REM יידל ורדיגר
REM יעקב שוואקי
REM ישי לפידות
REM ישי ריבו
REM ישיבה בויס
REM ישראל אדלר
REM ישראל דגן
REM ישראל ויליגר
REM ישראל ורדיגר
REM לוי כהן
REM לוי פלקוביץ
REM ליפא שמעלצר
REM מאיר אדלר
REM מוטי שטיינמץ
REM מונה רוזנבלום
REM מידד טסה
REM מיילך קהאן
REM מיכאל פרוזנסקי
REM מיכאל שטרייכר
REM מיכה גמרמן
REM מקהלת מלכות
REM מנדי ג'רופי
REM מנדי וייס
REM מרדכי בן דוד
REM מרדכי בן דוד
REM מרדכי שפירא
REM משה לאופר
REM משה פלד
REM משולם גרינברגר
REM נתנאל מנת
REM נפתלי קמפה
REM עדי רן
REM עוזיה צדוק
REM עמירן דביר
REM עמית ליסטוונד
REM פיני אינהורן
REM פרחי ירושלים
REM פרחי מיאמי
REM צבי זילברשטיין
REM צליל וזמר
REM צמאה
REM צמד ילד
REM קובי ברומר
REM קובי גרינבוים
REM קומזינג
REM הקינדרלעך
REM רולי דיקמן
REM שולי רנד
REM שלהבת
REM שלוימי גרטנר
REM שלוימי דסקל
REM שלום לעמער
REM שלוימי טויסיג
REM שלמה יהודה רכניץ
REM שלמה כהן
REM שלמה קרליבך
REM שלמה שמחה
REM שלשלת
REM שמואל גרינמן
REM שמחה ליינר
REM שמחה פרידמן
REM שמחת החיים
REM שמילי אונגר
REM שמעי אנגל
REM שרגי
REM משה קליין
REM דוד בן ארזה
REM אודי דמארי
REM אבישי אשל
REM אברהם מרדכי שוורץ
REM אבי קראוס
REM יונתן שיינפלד
REM שלוימי גרטנר
REM אהרן רזאל
REM ארי היל
REM אבריימי רוט
REM איציק ויינגרטן
REM אבי אילסון
REM שמילי אונגר
REM זאנוויל ויינברגר
REM שוקי סלומון
REM דודי קנופלר
REM הראל טל
REM דובי מייזלס
REM דובי מייזלס
REM ניסים בלאק
REM עקיבא געלב
REM מוטי וייס
REM שלוימי טויסיג
REM אמני ישראל
REM נחמן גולדברג
REM עמרם גרין
REM בן ציון קלצקו
REM גבי אהרון
REM אביגדור רוט
REM אבי בן ישראל
REM אלי סלומון
REM אלישע קלצקו
REM בנציון ווברמן
REM דוד שפירא
REM זאבי הופמן
REM יעקב שטיינרמן
REM מענדל ראטה
REM ראובן יזדיאן
REM שלום ברנהולץ
REM שלומי ברנשטיין
REM שלמה רגה
REM שמעון טובול
REM אליהו לייפער
REM איתמר שטיין
REM ארי בולזנשטיין
REM בני לאופר
REM שלומי וילמן
REM ירון בר
REM גיל ישראלוב
REM דוד חזיזה
REM דוד חפצדי
REM דני פלגון
REM יוני זיגמונד
REM חיים שלמה מייעס
REM יהודה שמעה
REM ישראל גברא
REM נתי לוי
REM עמיר בניון
REM מוטי אילוויטש
REM מוטי אילוויטש
REM מוטי אילוויטש
REM מאיר מסוארי
REM דן אביחי
REM שימי שפיץ
REM שמואל יצחקי
REM שמואל אלהרר
REM יואל אלהרר
REM יוסף נטיב
REM שלוימי טויסיג
REM גיל עקיביוב
REM דוידי נחשון
REM צבי גרינהיים
REM דוד שאבי
REM איציק אורלב
REM אלעד שער
REM אפרים מרקוביץ
REM אהרל'ה סמט
REM יאיר אלייצור
REM יאיר אלייצור
REM אהרל'ה סמט
REM בנצי קלצקין
REM אליהו חייט
REM אריה קונסטלר
REM חיים שלמה מייעס
REM מוטי אטיאס
REM מוטי ויזל
REM דודי פלדמן
REM מוישי שוורץ
REM מיקי שפיצר
REM משה לוק
REM ראובן גרבר
REM שרולי גרין
REM משה דוויק
REM יוסף חיים ביטון
REM גרשי אורי
REM רפאל סקורי
REM אבי קלצקו
REM אייל אביב
REM אליעד ספיר
REM גיא קהלני
REM משה דדון
REM הרשי רוטנברג
REM זלמן שטוב
REM יוני שלמה
REM ישראל גרופי
REM עובדיה חממה
REM שימי שטיינמעץ
REM שלומי שבת
REM מוטי רוזנפלד
REM אהרן קליין
REM אלעזר אסתרזון
REM יואל בריזל
REM אחיה הכהן
REM נחמן לייפר
REM מנחם אירנשטיין
REM אלי קליין
REM שמואל הררי
REM שמילי שטיינבערג
REM מוישי פריינד
REM יוני זיגמונד
REM יגל הרוש
REM חיים גנץ
REM אסף שפר
REM אריה קרלניסקי
REM איתן כץ
REM מאיר ריבקין
REM מאיר קליינר
REM אברהם דוד ורצברגר
REM אבי לרנר
REM חיים ישכיל
REM ישיבשיר
REM יוסי גלנץ
REM מוישי ולדמן
REM עומר ביטון
REM רפאל מלול
REM שמואל הוניג
REM מוטי אילוויטש
REM נח פלאי
REM מוטי אלטמן
REM מנדי גרופי
REM אריה קרלניסקי
REM מוישי פריינד
REM אסף הרוש
REM דניאל דהאן
REM מכביטס
REM שימי לפשיץ
REM עודד מנשרי
REM יהושע לימוני
REM מוטי כהן
REM חיים נחמן
REM יוחנן אורי
REM שמוליק קליין
REM אייל טוויטו
REM איציק שוורץ
REM חיים מרדכי אקשטיין
REM נהוראי אריאלי
REM עופר שמיר
REM עקיבא שכטר
REM אריאל רייכל
REM מנחם שוקרון
REM עדי גביסון
REM נתנאל ישראל
REM פינקי וובער
REM ארי ברמן
REM אליקים בוטה
REM דודי פרימשן
REM שלוימי קצנלבוגן
REM אהרל'ה סמט
REM שמואל יונה
REM מיכאל שניצלר
REM מיכאל אזולאי
REM נמואל הרוש
REM ברק כהן
REM עמנואל שולמן
REM שלוימי בוקשפן
REM פייבל גרינבערג
REM שרוליק רוזנטל
REM שלמה כץ
REM שרוליק רייזמן
REM יצחק מאיר
REM נועם רמתי
REM יחיאל ליכטיגר
REM פרויקט קפיצת הדרך
REM נח פלאי
