[
  {
    "type": "מאחורי הקלעים",
    "content": "התוכנה לא מסתפקת בשם הקובץ! היא בודקת גם את תגיות המטא-דאטה כמו 'אמן', 'כותרת' ואפילו 'אלבום' כדי לזהות את האמן באופן מדויק"
  },
  {
    "type": "מאחורי הקלעים",
    "content": "התוכנה נעזרת במודל AI קומפקטי ומהיר כדי לזהות אמנים! המודל מאפשר זיהוי שמות זמרים גם אם הם אינם קיימים ברשימה המובנית"
  },
  {
    "type": "טיפ",
    "content": "כדי למיין את תיקיות הזמרים בתוך תיקיות ראשיות לפי סדר א'-ב', הפעל את אפשרות **\"מיון אלפביתי\"** תחת  **אפשרויות מיון** > **מתקדם**"
  },
  {
    "type": "הידעת?",
    "content": "מאפייני השירים מוצגים ב*\"סינית*\" בנגן?  השתמש ב**\"תקן שמות\"**. פעולה זו תסיר תווים מיותרים ותתקן ג'יבריש"
  },
  {
    "type": "טיפ",
    "content": "כדי לשמור עותק של השירים בתיקיית המקור, בחר באפשרות **\"העתק קבצים\"** (במקום \"העבר קבצים\") תחת **אפשרויות מיון**"
  },
  {
    "type": "מאחורי הקלעים",
    "content": "התוכנה מזהה אוטומטית אלבומים שלמים וממיינת אותם לתיקייה נפרדת. היא מתחשבת במספר השירים בתיקיה, שמות האלבומים מספור השירים ומאפיינים נוספים"
  },
  {
    "type": "טיפ",
    "content": "כדי לייבא או לייצא רשימות זמרים, לחץ על **סמל שלוש הנקודות** > **הגדרות מתקדמות** > **יבא/יצא קובץ CSV**"
  },
  {
    "type": "הידעת?",
    "content": "התוכנה יודעת לטפל בדואטים! ניתן לבחור אם להעתיק את השיר לתיקייה של כל זמר המופיע בשיר, או רק לזמר הראשון, תחת **סמל שלוש הנקודות** > **הגדרות מתקדמות** > **מיון דואטים**"
  },
  {
    "type": "טיפ",
    "content": "כדי למנוע מהתוכנה ליצור תיקיות חדשות עבור אמנים, הפעל את האפשרות **\"השתמש בתיקיות קיימות בלבד\"** תחת **אפשרויות מיון**"
  },
  {
    "type": "טיפ",
    "content": "כדי לשמור את ההגדרות המועדפות עליך לחץ על **סמל השמירה** (הדיסקט) בפינה השמאלית התחתונה של כרטיס **אפשרויות מיון**"
  },
  {
    "type": "הידעת?",
    "content": "'מסדר הסינגלים' תומך במגוון רחב של פורמטי אודיו, ביניהם: mp3, wav, flac, m4a ועוד!"
  },
  {
    "type": "טיפ",
    "content": "אם התוכנה לא מזהה אמן מסוים, ניתן להוסיף אותו באופן ידני דרך **סמל שלוש הנקודות** > **הגדרות מתקדמות** > **ערוך רשימה**"
  },
  {
    "type": "הידעת?",
    "content": "התוכנה בודקת באופן אוטומטי אם קיימים עדכונים חדשים! כאשר יש עדכון, תופיע נקודה אדומה על סמל שלוש הנקודות בצד שמאל למעלה"
  },
  {
    "type": "טיפ",
    "content": "כדי לסדר רק את התיקייה הראשית, ללא תיקיות המשנה, הפעל את האפשרות **\"סרוק תיקיה ראשית בלבד\"** תחת **אפשרויות מיון**"
  },
  {
    "type": "טיפ",
    "content": "כדי שהתוכנה תיצור תיקיית \"סינגלים\" בתוך כל תיקיית אמן, ודא שהאפשרות **\"צור תיקיות סינגלים\"** מופעלת תחת **אפשרויות מיון** > **מתקדם**"
  },
  {
    "type": "הידעת?",
    "content": "בסיום פעולת המיון, התוכנה מציגה סיכום מפורט הכולל את כמות השירים שמויינו, התיקיות שנוצרו והאמנים המובילים"
  },
  {
    "type": "טיפ",
    "content": "כדי להגדיר את אופן מיון הדואטים לחץ על **סמל שלוש הנקודות** > **הגדרות מתקדמות** > **מיון דואטים**. שם תוכל לבחור בין העתקה לכל הזמרים או רק לזמר הראשון"
  },
  {
    "type": "מאחורי הקלעים",
    "content": "בלחיצה על \"תקן שמות\" התוכנה מסירה תוכן לא רלוונטי משמות הקבצים, כמו \"חדשות המוזיקה\", \"מייל מיוזיק\" ועוד"
  },
  {
    "type": "טיפ",
    "content": "נתקלתם בבעיה או שיש לכם שאלה? פנו לתמיכה דרך המייל: **mesader.singelim@gmail.com**"
  },
  {
    "type": "טיפ",
    "content": "מומלץ לגבות את קבצי המוזיקה לפני השימוש בתוכנה, ליתר ביטחון"
  }
]