import spacy
from spacy.training.example import Example

# read name of model
with open("model_name.txt", 'r', encoding='utf-8') as f:
    model_name = f.read()
    print(f'# {model_name}')

# Load your trained model
nlp = spacy.load(model_name)


examples = []
data = [
    ("'אבשלום ברסקי' והחברים בקומזיץ 'הבדלה' מושקע", {'entities': [(1, 13, 'SINGER')]}),
    ("טלי ליבוביץ - אנחנו טובים", {'entities': [(0, 11, 'SINGER')]}),
    ("מתנאל גמליאל ומתנאל גמליאל מגישים קאבר ''משיח''", {'entities': [(0, 12, 'SINGER')]}),
    ("יוסי טרבלסי משחרר שיר ''אלוקיי'' מאלבומו החדש ''אז ישיר''", {'entities': [(0, 11, 'SINGER')]}),
    ("אלישמע הלברשטאם מגיש סינגל חדש בשם ''נופל שדוד''", {'entities': [(0, 15, 'SINGER')]}),
    ("מישל זיגי במחרוזת משובחת בשם ''השפעות מוצאי שבת''", {'entities': [(0, 9, 'SINGER')]}),
    ("אבשלום ברסקי ואבשלום ברסקי במחרוזת קסומה עם מיטב שירי ר''ח", {'entities': [(0, 12, 'SINGER')]}),
    ("טלי ליבוביץ - ירושלים", {'entities': [(0, 11, 'SINGER')]}),
    ("מרדכי ארבל - אל נקמות ה", {'entities': [(0, 10, 'SINGER')]}),
    ("מרדכי ארבל הלחין ושר ''אשת חיל''", {'entities': [(0, 10, 'SINGER')]}),
    ("יגיע זמן - ליאם אנטר", {'entities': [(11, 20, 'SINGER')]}),
    ("אהרן מיללער - רוצה", {'entities': [(0, 11, 'SINGER')]}),
    ("אהרן מיללער-קרוב-מתמיד1", {'entities': [(0, 11, 'SINGER')]}),
    ("מישל זיגי בסינגל עוצמתי ומחבר ''אל תוותר''", {'entities': [(0, 9, 'SINGER')]}),
    ("בניה רוזוב מפתיע ומשחרר סינגל חדש בסטייל השמור רק לו ''מודים''", {'entities': [(0, 10, 'SINGER')]}),
    ("יהלי בסר-ומקהלת-נרננה-שרים-שוובר-ועל-חסדך", {'entities': [(0, 8, 'SINGER')]}),
    ("עוז שמחי - מחרוזת לב & נשמה", {'entities': [(0, 8, 'SINGER')]}),
    ("אבשלום ברסקי בסינגל בכורה חדש ''אני פה להישאר''", {'entities': [(0, 12, 'SINGER')]}),
    ("ליפא’ס ערשטע טאנץ - דורון אייל", {'entities': [(20, 30, 'SINGER')]}),
    ("צוריאל אמון לא נח לרגע ומגיש מחרוזת חופה מרגשת עם מיטב הלהיטים", {'entities': [(0, 11, 'SINGER')]}),
    ("משולם וורקו  - גוט מארגן", {'entities': [(0, 11, 'SINGER')]}),
    ("דורון מימוני, דורון מימוני וגדולי הזמר בסדרת חופה מרהיבה ''ברוך הבא''", {'entities': [(0, 12, 'SINGER')]}),
    ("ליאם אנטר ותזמורתו של ליאם אנטר במחרוזת ''שירי שלמה''", {'entities': [(0, 9, 'SINGER')]}),
    ("שמשון רוחלין מפתיע בסינגל חדש ''לבוש שחורים''", {'entities': [(0, 12, 'SINGER')]}),
    ("שמשון רוחלין והמכונות - מרבים בשמחה", {'entities': [(0, 12, 'SINGER')]}),
    ("מישל זיגי בסינגל חדש ''כבד את אביך''", {'entities': [(0, 9, 'SINGER')]}),
    ("עמינדב קוטובסקי משיק סינגל חדש מעומק הלב ''נחלי דמעות''", {'entities': [(0, 15, 'SINGER')]}),
    ("חיה רם ואביו פינקי בסינגל חדש ''געבליבן מיט דיר''", {'entities': [(0, 6, 'SINGER')]}),
    ("טלי ליבוביץ במחרוזת להיטי טלי ליבוביץ", {'entities': [(0, 11, 'SINGER')]}),
    ("מיטל בילינסון והחברים בשירה שכולו ערגה וכיסופין ''שלשידעס''", {'entities': [(0, 13, 'SINGER')]}),
]



for text, annots in data:
    doc = nlp.make_doc(text)
    examples.append(Example.from_dict(doc, annots))
print(nlp.evaluate(examples))

"""
for key, value in results.items():
    if not value is None and not value == 0.0 and not value == {}:
        print(f"{key:<5}: {value}")
"""
        