import spacy
from spacy.training.example import Example

# read name of model
with open("model_name.txt", 'r', encoding='utf-8') as f:
    model_name = f.read()
    print(f'# {model_name}')

# Load your trained model
nlp = spacy.load(model_name)


examples = []
data = [
    ("'זוהר עמוס' והחברים בקומזיץ 'הבדלה' מושקע", {'entities': [(1, 10, 'SINGER')]}),
    ("מאיר אביב - אנחנו טובים", {'entities': [(0, 9, 'SINGER')]}),
    ("אביעד אליזרוב ורובי אהרוני מגישים קאבר ''משיח''", {'entities': [(0, 13, 'SINGER'), (15, 26, 'SINGER')]}),
    ("ינאי טל משחרר שיר ''אלוקיי'' מאלבומו החדש ''אז ישיר''", {'entities': [(0, 7, 'SINGER')]}),
    ("זלמן אפרים מגיש סינגל חדש בשם ''נופל שדוד''", {'entities': [(0, 10, 'SINGER')]}),
    ("שלומי חזן במחרוזת משובחת בשם ''השפעות מוצאי שבת''", {'entities': [(0, 9, 'SINGER')]}),
    ("צפריר נתנזון וחיים משה רכניץ במחרוזת קסומה עם מיטב שירי ר''ח", {'entities': [(0, 12, 'SINGER'), (14, 28, 'SINGER')]}),
    ("סאן שולבאום - ירושלים", {'entities': [(0, 11, 'SINGER')]}),
    ("אבירם כראל - אל נקמות ה", {'entities': [(0, 10, 'SINGER')]}),
    ("להב נאומן הלחין ושר ''אשת חיל''", {'entities': [(0, 9, 'SINGER')]}),
    ("יגיע זמן - אריה פאר", {'entities': [(11, 19, 'SINGER')]}),
    ("הגר מזרחי - רוצה", {'entities': [(0, 9, 'SINGER')]}),
    ("גורן פנחס-קרוב-מתמיד1", {'entities': [(0, 9, 'SINGER')]}),
    ("נדב מירנדה בסינגל עוצמתי ומחבר ''אל תוותר''", {'entities': [(0, 10, 'SINGER')]}),
    ("דוד יצחק אמיר מפתיע ומשחרר סינגל חדש בסטייל השמור רק לו ''מודים''", {'entities': [(0, 13, 'SINGER')]}),
    ("תם ריטר-ומקהלת-נרננה-שרים-שוובר-ועל-חסדך", {'entities': [(0, 7, 'SINGER')]}),
    ("הדר שנברגר - מחרוזת לב & נשמה", {'entities': [(0, 10, 'SINGER')]}),
    ("ריאן סילמן בסינגל בכורה חדש ''אני פה להישאר''", {'entities': [(0, 10, 'SINGER')]}),
    ("ליפא’ס ערשטע טאנץ - משה אילוביץ", {'entities': [(20, 31, 'SINGER')]}),
    ("רפאל נחמיאס לא נח לרגע ומגיש מחרוזת חופה מרגשת עם מיטב הלהיטים", {'entities': [(0, 11, 'SINGER')]}),
    ("יואל נוף  - גוט מארגן", {'entities': [(0, 8, 'SINGER')]}),
    ("כרמי מיכאל, איתיאל קרליבך וגדולי הזמר בסדרת חופה מרהיבה ''ברוך הבא''", {'entities': [(0, 10, 'SINGER'), (12, 25, 'SINGER')]}),
    ("פיני ברגר ותזמורתו של עמי אילן במחרוזת ''שירי שלמה''", {'entities': [(0, 9, 'SINGER'), (22, 30, 'SINGER')]}),
    ("דותן יהודה מפתיע בסינגל חדש ''לבוש שחורים''", {'entities': [(0, 10, 'SINGER')]}),
    ("רוי קלפפיש והמכונות - מרבים בשמחה", {'entities': [(0, 10, 'SINGER')]}),
    ("לירון קהתי בסינגל חדש ''כבד את אביך''", {'entities': [(0, 10, 'SINGER')]}),
    ("אופרי ליטווק משיק סינגל חדש מעומק הלב ''נחלי דמעות''", {'entities': [(0, 12, 'SINGER')]}),
    ("איתי מתתיהו ואביו קורן דניאל בסינגל חדש ''געבליבן מיט דיר''", {'entities': [(0, 11, 'SINGER'), (18, 28, 'SINGER')]}),
    ("גילן סלומוביץ במחרוזת להיטי אלי דן", {'entities': [(0, 13, 'SINGER'), (28, 34, 'SINGER')]}),
    ("יחזקאל בורפקר והחברים בשירה שכולו ערגה וכיסופין ''שלשידעס''", {'entities': [(0, 13, 'SINGER')]}),
    ("יובל נוה - והערב נא", {'entities': [(0, 8, 'SINGER')]}),
    ("מתן ונטורה - תמיד אוהב אותי", {'entities': [(0, 10, 'SINGER')]}),
    ("אורן דוד - גם כי אלך (קאבר עטלף עיוור)", {'entities': [(0, 8, 'SINGER')]}),
    ("ריו אקשטיין - חופה ליד", {'entities': [(0, 11, 'SINGER')]}),
    ("אלישע אברהמי - בא לי", {'entities': [(0, 12, 'SINGER')]}),
    ("גדעון גרייף - באה השמחה", {'entities': [(0, 11, 'SINGER')]}),
    ("Joey-Newcomb-Kaeileh-אסתר רוזנברג-כאלה", {'entities': [(21, 33, 'SINGER')]}),
    ("אליעד שפילמן-מקהלת-קאפלה-אלוקי-נשמה-MP3", {'entities': [(0, 12, 'SINGER')]}),
    ("אשריכם תלמידי חכמים - יוסף חיים בוסקילה - ווקאלי", {'entities': [(22, 39, 'SINGER')]}),
    ("רעיה בן ארי - הטוב ישאר", {'entities': [(0, 11, 'SINGER')]}),
    ("אליאור זיגל - מימיני מיכאל", {'entities': [(0, 11, 'SINGER')]}),
    ("שם-טוב דרוקר - לך על זה", {'entities': [(0, 12, 'SINGER')]}),
    ("אמנון אבייב - באתי לגני", {'entities': [(0, 11, 'SINGER')]}),
    ("דביר פיומי - ישתבח שמך", {'entities': [(0, 10, 'SINGER')]}),
    ("בנג'מין יוסף ואליהו זיסו - מסלסלים", {'entities': [(0, 12, 'SINGER'), (14, 24, 'SINGER')]}),
    ("נורית נוביק - אני יהודי", {'entities': [(0, 11, 'SINGER')]}),
    ("אבי סלמה - כדאי ר' שמעון", {'entities': [(0, 8, 'SINGER')]}),
    ("ליאב הייטנר & אלכסנדר רוזנבאום - מחרוזת ריקודים", {'entities': [(0, 11, 'SINGER'), (14, 30, 'SINGER')]}),
    ("מלך מלכי המלכים סתיו צברי", {'entities': [(16, 25, 'SINGER')]}),
    ("לביא מרגלית .שדרן שיר", {'entities': [(0, 11, 'SINGER')]}),
    ("רון חרמון & אלברט נחום - כי אנו עמך", {'entities': [(0, 9, 'SINGER'), (12, 22, 'SINGER')]}),
    ("בנג'ו בילי - מאמא דיאלי", {'entities': [(0, 10, 'SINGER')]}),
    ("ערן ציגלר - אל מסתתר", {'entities': [(0, 9, 'SINGER')]}),
    ("עתי אמיגה - נסיעה ארוכה", {'entities': [(0, 9, 'SINGER')]}),
    ("יועד בילסקי גדול השלום", {'entities': [(0, 11, 'SINGER')]}),
    ("ניגוני יהודה (נחמיה מירטנבאום) triste esta el rey david", {'entities': [(14, 29, 'SINGER')]}),
    ("נתנאל & אליהו זיסו והיא שעמדה", {'entities': [(8, 18, 'SINGER')]}),
    ("סט 2019  דיגי ערן ציגלר (320  kbps) (vipman.xyz)", {'entities': [(14, 23, 'SINGER')]}),
    ("פיני ברגר סינגל", {'entities': [(0, 9, 'SINGER')]}),
    ("הדר שנברגר עם מדרשת תפארת בחורים - אתיתי לחננך", {'entities': [(0, 10, 'SINGER')]}),
    ("אורן דוד ומאיר אביב חזו בני", {'entities': [(0, 8, 'SINGER'), (10, 19, 'SINGER')]}),
    ("בנג'מין יוסף & מתן ונטורה - הושיע אותנו", {'entities': [(0, 12, 'SINGER'), (15, 25, 'SINGER')]}),
    ("אביעד אליזרוב ואסתר רוזנברג מקפיצים", {'entities': [(0, 13, 'SINGER'), (15, 27, 'SINGER')]}),
    ("איתיאל קרליבך - עננו - anenu - sruli ginsberg", {'entities': [(0, 13, 'SINGER')]}),
    ("אלברט נחום - והלוואי - Tamir Mizrachi - Vehalevai", {'entities': [(0, 10, 'SINGER')]}),
    ("ברכת המזון המנגינה שהלחין עמי אילן", {'entities': [(26, 34, 'SINGER')]}),
    ("נחמיה מירטנבאום - במסע החיים", {'entities': [(0, 15, 'SINGER')]}),
    ("ליאב הייטנר שיפקדוני", {'entities': [(0, 11, 'SINGER')]}),
    ("צפריר נתנזון ואליעד שפילמן ''ידע כל פעול''", {'entities': [(0, 12, 'SINGER'), (14, 26, 'SINGER')]}),
    ("הגר מזרחי ואבי סלמה מרגשים במחרוזת ''ימים נוראים''", {'entities': [(0, 9, 'SINGER'), (11, 19, 'SINGER')]}),
    ("אלישע אברהמי, יובל נוה - אני מאמין", {'entities': [(0, 12, 'SINGER'), (14, 22, 'SINGER')]}),
    ("נחמן ואופרי ליטווק - ניגון וזמרה", {'entities': [(6, 18, 'SINGER')]}),
    ("רוי קלפפיש בסינגל חדש לימים הנוראים ''אבינו מלכנו''", {'entities': [(0, 10, 'SINGER')]}),
    ("שלומי חזן, אריה פאר - האיש מוילנא", {'entities': [(0, 9, 'SINGER'), (11, 19, 'SINGER')]}),
    ("סתיו צברי, חיים משה רכניץ - כי הנה כחומר", {'entities': [(0, 9, 'SINGER'), (11, 25, 'SINGER')]}),
    ("רעיה בן ארי - האזינו", {'entities': [(0, 11, 'SINGER')]}),
    ("דוד יצחק אמיר & ריאן סילמן - תשרי מיקס", {'entities': [(0, 13, 'SINGER'), (16, 26, 'SINGER')]}),
    ("דותן יהודה - מצוה טאנץ מושלם", {'entities': [(0, 10, 'SINGER')]}),
    ("יחזקאל בורפקר & יוסף חיים בוסקילה - בריה אחת", {'entities': [(0, 13, 'SINGER'), (16, 33, 'SINGER')]}),
    ("אבירם כראל & משה אילוביץ - שופט כל הארץ", {'entities': [(0, 10, 'SINGER'), (13, 24, 'SINGER')]}),
    ("בנג'ו בילי - דאס לעצטע דוכנ'ען", {'entities': [(0, 10, 'SINGER')]}),
    ("Arik Einstein גורן פנחס לפעמים(MP3_320K)", {'entities': [(14, 23, 'SINGER')]}),
    ("שם-טוב דרוקר - עוד דקה את נעלמת(MP3_160K)", {'entities': [(0, 12, 'SINGER')]}),
    ("יועד בילסקי וגילן סלומוביץ - עוד דקה את נעלמת(MP3_320K)", {'entities': [(0, 11, 'SINGER'), (13, 26, 'SINGER')]}),
    ("נדב מירנדה - מיכל(MP3_320K)", {'entities': [(0, 10, 'SINGER')]}),
    ("רון חרמון - הגולה - Dudu Tassa - Hagole(MP3_320K)", {'entities': [(0, 9, 'SINGER')]}),
    ("לירון קהתי - הלא נודע(MP3_320K)", {'entities': [(0, 10, 'SINGER')]}),
    ("אלי דן וסאן שולבאום - זאת שמעל למצופה(MP3_320K)", {'entities': [(0, 6, 'SINGER'), (8, 19, 'SINGER')]}),
    ("עתי אמיגה - זאת שמעל לכל המצופה(MP3_320K)", {'entities': [(0, 9, 'SINGER')]}),
    ("הכוכב הבא 2022 -- נורית נוביק - זאת שמעל לכל המצופה(MP3_320K)", {'entities': [(18, 29, 'SINGER')]}),
    ("לביא מרגלית - חופים הם לפעמים(MP3_320K)", {'entities': [(0, 11, 'SINGER')]}),
    ("אליאור זיגל ואלכסנדר רוזנבאום - סהרה (חי בלייב פארק)(MP3_320K)", {'entities': [(0, 11, 'SINGER'), (13, 29, 'SINGER')]}),
    ("דביר פיומי - חופים הם לפעמים(MP3_320K)", {'entities': [(0, 10, 'SINGER')]}),
    ("פול טראנק עם כרמי מיכאל - סתלבט בקיבוץ(MP3_320K)", {'entities': [(13, 23, 'SINGER')]}),
    ("זוהר עמוס מעלה מעלה Svika Pick(MP3_320K)", {'entities': [(0, 9, 'SINGER')]}),
    ("יואל נוף לא_נרגע_Avihai_Hollender_Lo_Nirga", {'entities': [(0, 8, 'SINGER')]}),
    ("ינאי טל, איתי מתתיהו ורובי אהרוני - רואים רחוק רואים שקוף", {'entities': [(0, 7, 'SINGER'), (9, 20, 'SINGER'), (22, 33, 'SINGER')]}),
    ("ריו אקשטיין וזה יבוא אתה תראה", {'entities': [(0, 11, 'SINGER')]}),
    ("תם ריטר אצלנו בגן", {'entities': [(0, 7, 'SINGER')]}),
    ("קורן דניאל...לכה דודי", {'entities': [(0, 10, 'SINGER')]}),
]



for text, annots in data:
    doc = nlp.make_doc(text)
    examples.append(Example.from_dict(doc, annots))
print(nlp.evaluate(examples))

"""
for key, value in results.items():
    if not value is None and not value == 0.0 and not value == {}:
        print(f"{key:<5}: {value}")
"""