import sys
import spacy
from spacy.training.example import Example

# read name of model
if len(sys.argv) > 1:
    model_name = f"custom_ner_model{sys.argv[1]}git"
    print(f"# {model_name}")
else:
    with open("model_name.txt", 'r', encoding='utf-8') as f:
        model_name = f.read()
        print(f'# {model_name}')


# Load your trained model
nlp = spacy.load(model_name)


examples = []
data = [
    ("'משה בוזגלו' והחברים בקומזיץ 'הבדלה' מושקע.mp3", {'entities': [(1, 11, 'SINGER')]}),
    ("אוריה סממה - אנחנו טובים.mp3", {'entities': [(0, 10, 'SINGER')]}),
    ("אבנר אפריאט ויעקב איתמר מגישים קאבר ''משיח''.mp3", {'entities': [(0, 11, 'SINGER'), (13, 23, 'SINGER')]}),
    ("איתן אילני משחרר שיר ''אלוקיי'' מאלבומו החדש ''אז ישיר''.mp3", {'entities': [(0, 10, 'SINGER')]}),
    ("יובל שפיגלמן מגיש סינגל חדש בשם ''נופל שדוד''.mp3", {'entities': [(0, 12, 'SINGER')]}),
    ("ניר שטרית במחרוזת משובחת בשם ''השפעות מוצאי שבת''.mp3", {'entities': [(0, 9, 'SINGER')]}),
    ("אנטוני סלומון ויוסף צברי במחרוזת קסומה עם מיטב שירי ר''ח.mp3", {'entities': [(0, 13, 'SINGER'), (15, 24, 'SINGER')]}),
    ("עידו דניאלי בסינגל עוצמתי ומחבר ''אל תוותר''.mp3", {'entities': [(0, 11, 'SINGER')]}),
    ("אבנר גולה מפתיע ומשחרר סינגל חדש בסטייל השמור רק לו ''מודים''.mp3", {'entities': [(0, 9, 'SINGER')]}),
    ("מקהלת בית רבן ויעקב סיבוני שרים שוובר ועל חסדך.mp3", {'entities': [(0, 13, 'SINGER'), (15, 26, 'SINGER')]}),
    ("איתמר סיטבון - מחרוזת לב & נשמה.mp3", {'entities': [(0, 12, 'SINGER')]}),
    ("גיא סוזנה בסינגל בכורה חדש ''אני פה להישאר''.mp3", {'entities': [(0, 9, 'SINGER')]}),
    ("ליפא’ס ערשטע טאנץ - רוי ווסה.mp3", {'entities': [(20, 28, 'SINGER')]}),
    ("יעקב מגידש לא נח לרגע ומגיש מחרוזת חופה מרגשת עם מיטב הלהיטים.mp3", {'entities': [(0, 10, 'SINGER')]}),
    ("טל פוגל, זאב גפן וגדולי הזמר בסדרת חופה מרהיבה ''ברוך הבא''.mp3", {'entities': [(0, 7, 'SINGER'), (9, 16, 'SINGER')]}),
    ("אסף תמיר ותזמורתו של בני ג'וסף במחרוזת ''שירי שלמה''.mp3", {'entities': [(0, 8, 'SINGER'), (21, 30, 'SINGER')]}),
    ("חיים זליקוביץ מפתיע בסינגל חדש ''לבוש שחורים''.mp3", {'entities': [(0, 13, 'SINGER')]}),
    ("יאיר קשמה והמכונות - מרבים בשמחה.mp3", {'entities': [(0, 9, 'SINGER')]}),
    ("מרק ויזגן בסינגל חדש ''כבד את אביך''.mp3", {'entities': [(0, 9, 'SINGER')]}),
    ("גלעד פרטר משיק סינגל חדש מעומק הלב ''נחלי דמעות''.mp3", {'entities': [(0, 9, 'SINGER')]}),
    ("עמית מס ואביו יהונתן גובי בסינגל חדש ''געבליבן מיט דיר''.mp3", {'entities': [(0, 7, 'SINGER'), (14, 25, 'SINGER')]}),
    ("יהודה ברקו במחרוזת להיטי בר פריאנטה.mp3", {'entities': [(0, 10, 'SINGER'), (25, 35, 'SINGER')]}),
    ("אברהם טפירו והחברים בשירה שכולו ערגה וכיסופין ''שלשידעס''.mp3", {'entities': [(0, 11, 'SINGER')]}),
    ("Joey-Newcomb-Kaeileh-תום ביטון-כאלה.mp3", {'entities': [(21, 30, 'SINGER')]}),
    ("ישראל דרויאן עידן בוחבוט אלוקי נשמה MP3.mp3", {'entities': [(0, 12, 'SINGER'), (13, 24, 'SINGER')]}),
    ("אשריכם תלמידי חכמים - אמיר בנימין - ווקאלי.mp3", {'entities': [(22, 33, 'SINGER')]}),
    ("אופק ריינר ואהרון חג'בי - מסלסלים.mp3", {'entities': [(0, 10, 'SINGER'), (12, 23, 'SINGER')]}),
    ("יוסף ווסקובויניקוב & יובל כהן - מחרוזת ריקודים.mp3", {'entities': [(0, 18, 'SINGER'), (21, 29, 'SINGER')]}),
    ("מלך מלכי המלכים שגיא פוקס.mp3", {'entities': [(16, 25, 'SINGER')]}),
    ("גיל בן-ארי .שדרן שיר.mp3", {'entities': [(0, 10, 'SINGER')]}),
    ("אבישי זקצר & אריאל טבול - כי אנו עמך.mp3", {'entities': [(0, 10, 'SINGER'), (13, 23, 'SINGER')]}),
    ("ניגוני יהודה (נוי רזון) triste esta el rey david.mp3", {'entities': [(14, 22, 'SINGER')]}),
    ("נתנאל & משה אזולאי והיא שעמדה.mp3", {'entities': [(8, 18, 'SINGER')]}),
    ("סט 2019  דיגי עומר שגב (320  kbps) (vipman.xyz).mp3", {'entities': [(14, 22, 'SINGER')]}),
    ("איתי גלינסקי סינגל.mp3", {'entities': [(0, 12, 'SINGER')]}),
    ("עזרא עוזרי עם מדרשת תפארת בחורים - אתיתי לחננך.mp3", {'entities': [(0, 10, 'SINGER')]}),
    ("יהונתן כהן ועידו מזוז חזו בני.mp3", {'entities': [(0, 10, 'SINGER'), (12, 21, 'SINGER')]}),
    ("דניאל שנטל & ליר אזולוס - הושיע אותנו.mp3", {'entities': [(0, 10, 'SINGER'), (13, 23, 'SINGER')]}),
    ("דרור גולן ואבנר אבו מקפיצים", {'entities': [(0, 9, 'SINGER'), (11, 19, 'SINGER')]}),
    ("יהונתן פטרזיל - עננו - anenu - sruli ginsberg.mp3", {'entities': [(0, 13, 'SINGER')]}),
    ("רונן שגב - והלוואי - Tamir Mizrachi - Vehalevai.mp3", {'entities': [(0, 8, 'SINGER')]}),
    ("ברכת המזון המנגינה שהלחין תומר סבח.mp3", {'entities': [(26, 34, 'SINGER')]}),
    ("עירד נגר - במסע החיים.mp3", {'entities': [(0, 8, 'SINGER')]}),
    ("מנחם אזרן שיפקדוני.mp3", {'entities': [(0, 9, 'SINGER')]}),
    ("תמיר טל ושמואל קיפגן ''ידע כל פעול''.mp3", {'entities': [(0, 7, 'SINGER'), (9, 20, 'SINGER')]}),
    ("אריאל ביסטרוב ויהונתן פליי מרגשים במחרוזת ''ימים נוראים''.mp3", {'entities': [(0, 13, 'SINGER'), (15, 26, 'SINGER')]}),
    ("אלירן ווקנין, איתי לוי - אני מאמין.mp3", {'entities': [(0, 12, 'SINGER'), (14, 22, 'SINGER')]}),
    ("יעקב בטיטו - ניגון וזמרה.mp3", {'entities': [(0, 10, 'SINGER')]}),
    ("אריאל קורלנד בסינגל חדש לימים הנוראים ''אבינו מלכנו''.mp3", {'entities': [(0, 12, 'SINGER')]}),
    ("לביא חדד, בועז איילה - האיש מוילנא.mp3", {'entities': [(0, 8, 'SINGER'), (10, 20, 'SINGER')]}),
    ("חיים כהן, יהלי מעלם - כי הנה כחומר.mp3", {'entities': [(0, 8, 'SINGER'), (10, 19, 'SINGER')]}),
    ("יוגב אמסלם & אפיק סעד - תשרי מיקס.mp3", {'entities': [(0, 10, 'SINGER'), (13, 21, 'SINGER')]}),
    ("מתן שמו - מצוה טאנץ מושלם.mp3", {'entities': [(0, 7, 'SINGER')]}),
    ("מקהלת שישו ושמחו & אוהד מוגילבסקי - בריה אחת.mp3", {'entities': [(0, 16, 'SINGER'), (19, 33, 'SINGER')]}),
    ("יחיאל מינץ & נחמיה לרנר - שופט כל הארץ.mp3", {'entities': [(0, 10, 'SINGER'), (13, 23, 'SINGER')]}),
    ("מתן שפר - דאס לעצטע דוכנ'ען.mp3", {'entities': [(0, 7, 'SINGER')]}),
    ("Arik Einstein פאר נח לפעמים(MP3_320K).mp3", {'entities': [(14, 20, 'SINGER')]}),
    ("נפתלי גרפל - עוד דקה את נעלמת(MP3_160K).mp3", {'entities': [(0, 10, 'SINGER')]}),
    ("זיו כהן ואמיתי אלבז - עוד דקה את נעלמת(MP3_320K).mp3", {'entities': [(0, 7, 'SINGER'), (9, 19, 'SINGER')]}),
    ("נתן ארזי - מיכל(MP3_320K).mp3", {'entities': [(0, 8, 'SINGER')]}),
    ("אופק מתן - הגולה - Dudu Tassa - Hagole(MP3_320K).mp3", {'entities': [(0, 8, 'SINGER')]}),
    ("בניה בורובסקי - הלא נודע(MP3_320K).mp3", {'entities': [(0, 13, 'SINGER')]}),
    ("דוד אליאב ואהרון קפרא - זאת שמעל למצופה(MP3_320K).mp3", {'entities': [(0, 9, 'SINGER'), (11, 21, 'SINGER')]}),
    ("שגיא גרמון - זאת שמעל לכל המצופה(MP3_320K).mp3", {'entities': [(0, 10, 'SINGER')]}),
    ("הכוכב הבא 2022 -- יצחק שיינרמן - זאת שמעל לכל המצופה(MP3_320K).mp3", {'entities': [(18, 30, 'SINGER')]}),
    ("עידו פולק - חופים הם לפעמים(MP3_320K).mp3", {'entities': [(0, 9, 'SINGER')]}),
    ("יהודה וויספיש ושגיא אזולאי - סהרה (חי בלייב פארק)(MP3_320K).mp3", {'entities': [(0, 13, 'SINGER'), (15, 26, 'SINGER')]}),
    ("איתי קרמר - חופים הם לפעמים(MP3_320K).mp3", {'entities': [(0, 9, 'SINGER')]}),
    ("מרדכי יצחקי עם חיים אלמלך - סתלבט בקיבוץ(MP3_320K).mp3", {'entities': [(0, 11, 'SINGER'), (15, 25, 'SINGER')]}),
    ("רונן דולינסקי מעלה מעלה Svika Pick(MP3_320K).mp3", {'entities': [(0, 13, 'SINGER')]}),
    ("יצחק ביגל לא_נרגע_Avihai_Hollender_Lo_Nirga.mp3", {'entities': [(0, 9, 'SINGER')]}),
    ("אופיר שפיגל, אופק חן וזיו אלמקיאס - רואים רחוק רואים שקוף.mp3", {'entities': [(0, 11, 'SINGER'), (13, 20, 'SINGER'), (22, 33, 'SINGER')]}),
    ("גבריאל טובול...לכה דודי.mp3", {'entities': [(0, 12, 'SINGER')]}),
    ("גפן אליה מזור ואליהו מידן", {'entities': [(4, 13, 'SINGER'), (15, 25, 'SINGER')]}),
    ("01 רני הלוי מתפלל בשיר חדש ''ותתן לנו חיים''", {'entities': [(3, 11, 'SINGER')]}),
    ("להקת אש ומים & בן זיונס - שירת הבקשות", {'entities': [(0, 12, 'SINGER'), (15, 23, 'SINGER')]}),
    ("אלחנן מאיר שליט''א ימי בין המצרים", {'entities': [(0, 10, 'SINGER')]}),
    ("20 ואתה אמרת - יהלי קדמן", {'entities': [(15, 24, 'SINGER')]}),
    ("דרור יקרא אלעד ויסמן", {'entities': [(10, 20, 'SINGER')]}),
    ("גל רוט במחרוזת מקפיצה ''הייליגע הקפות''", {'entities': [(0, 6, 'SINGER')]}),
    ("המלחין הישיבתי אורי צמח מגיש יראת השם", {'entities': [(15, 23, 'SINGER')]}),
    ("מחרוזת צמאה יובל חבקוק", {'entities': [(12, 22, 'SINGER')]}),
    ("אביתר רטנר - ואפילו בהסתרה צלצול", {'entities': [(0, 10, 'SINGER')]}),
    ("אמנון קרן בסינגל חדש ''מה מנגן בך''", {'entities': [(0, 9, 'SINGER')]}),
    ("שיר מזמור לדוד אימרי שלוסברג", {'entities': [(15, 28, 'SINGER')]}),
    ("ירושלים - ג' ופנחס בוקובזה", {'entities': [(14, 26, 'SINGER')]}),
    ("שלום גרמאי ובנו שמעון שרים ליקוטי מוהרן", {'entities': [(0, 10, 'SINGER')]}),
    ("אליעזר שמיר שר ''יום יבוא'' על הגאולה העתידה", {'entities': [(0, 11, 'SINGER')]}),
    ("יוסף פז , אריה גיגי - Señorita (קאבר)", {'entities': [(0, 7, 'SINGER'), (10, 19, 'SINGER')]}),
    ("אושר מנחם בסינגל חדש – רועה נאמן", {'entities': [(0, 9, 'SINGER')]}),
    ("יואב סילם - ניגון הבעל שם טוב", {'entities': [(0, 9, 'SINGER')]}),
    ("בזכות הצדיק - אלון דגני", {'entities': [(14, 23, 'SINGER')]}),
    ("ניצן קופף ובנו שעיה מגישים סינגל חדש 'בספר חיים'", {'entities': [(0, 9, 'SINGER')]}),
    ("12. אך לא-לוהים - מאיר אוזן", {'entities': [(18, 27, 'SINGER')]}),
    ("אלירן סבן ממשיך בקאבר מרגש ''מאמע רחל''", {'entities': [(0, 9, 'SINGER')]}),
    ("אלי חופי & אוהד רחבי - איך נשיר ירושלים", {'entities': [(0, 8, 'SINGER'), (11, 20, 'SINGER')]}),
    ("יועד סויסה, בנימין קניאל וגדולי הזמר בסדרת חופה מרהיבה ''ברוך הבא''", {'entities': [(0, 10, 'SINGER'), (12, 24, 'SINGER')]}),
    ("אייל בסטקר ורותם נח מחרוזת ליפא   [איכות גבוהה]", {'entities': [(0, 10, 'SINGER'), (12, 19, 'SINGER')]}),
    ("Benny - Kulam Sharim (Single) רועי עיני - כולם שרים", {'entities': [(30, 39, 'SINGER')]}),
    ("06 על משכבי - עם אליאב אבינועם", {'entities': [(17, 30, 'SINGER')]}),
    ("02) אשירה לד' - דודי יוזוק", {'entities': [(16, 26, 'SINGER')]}),
    ("אורן מיזל, אבישי חדד, מרדכי פארי, איתי חיים - וזכני", {'entities': [(0, 9, 'SINGER'), (11, 20, 'SINGER'), (22, 32, 'SINGER'), (34, 43, 'SINGER')]}),
    ("שירי שחר כהן", {'entities': [(5, 12, 'SINGER')]}),
    ("שון שפיצר טאנץ...", {'entities': [(0, 9, 'SINGER')]}),
    ("גיל רבין - געב א שמייכל (תן חיוך)", {'entities': [(0, 8, 'SINGER')]}),
    ("14 ידידיה אבוחצירא מציג את יונתן מוטיעי וניסים ברץ", {'entities': [(3, 18, 'SINGER'), (27, 39, 'SINGER'), (41, 50, 'SINGER')]}),
    ("שאול פנחסוב אליך", {'entities': [(0, 11, 'SINGER')]}),
    ("בנימין אורלן כשהלב בוכה מאיר פרץ עונה 3", {'entities': [(0, 12, 'SINGER'), (24, 32, 'SINGER')]}),
    ("גולדיס געשיכטע - יובל סיביליה ויונתן מויאל", {'entities': [(17, 29, 'SINGER'), (31, 42, 'SINGER')]}),
    ("שיר הפתק נועם שמחון", {'entities': [(9, 19, 'SINGER')]}),
    ("מחרוזת מזמור לתודה עומר ברמי", {'entities': [(19, 28, 'SINGER')]}),
    ("שי מוגס - אינשאלה יבוא היום", {'entities': [(0, 7, 'SINGER')]}),
    ("יצחק צפרי משחררים להיט קייצי עולה עולה", {'entities': [(0, 9, 'SINGER')]}),
    ("הזמר מור שניידר מגיש בלדה מרגשת 'הילד של אבא'", {'entities': [(5, 15, 'SINGER')]}),
    ("עומר יוסף בביצוע מרטיט ומרגש  ויהיו רחמיך, השיר המלא", {'entities': [(0, 9, 'SINGER')]}),
    ("ביצוע משיריו האחרונים של ר  אלון שרביט זל", {'entities': [(28, 38, 'SINGER')]}),
    ("אסף אבוטבול - הנרות הללו", {'entities': [(0, 11, 'SINGER')]}),
    ("אברהם קופולוביץ & אביב רואס ''השמים''", {'entities': [(0, 15, 'SINGER'), (18, 27, 'SINGER')]}),
    ("שמעון פיק זוהר קרופרו וחיים הרפז ב''מחרוזת השלוחים''", {'entities': [(0, 9, 'SINGER'), (10, 21, 'SINGER'), (23, 32, 'SINGER')]}),
    ("יהודה טורקניץ  (29)", {'entities': [(0, 13, 'SINGER')]}),
    ("זמירות ליל שבת - עידו לובינסקי ולביא גוטפריד ועידן לוטן", {'entities': [(17, 30, 'SINGER'), (32, 44, 'SINGER'), (46, 55, 'SINGER')]}),
    ("12. דן צפדיה, אילן עני, א.ח. גרין, נדב רויטמן - והראינו", {'entities': [(4, 12, 'SINGER'), (14, 22, 'SINGER'), (35, 45, 'SINGER')]}),
    ("מרדכי סט פורים - [WinDos.Co]", {'entities': [(0, 8, 'SINGER')]}),
    ("הרב נתן שפירו שליט''א פרשת פרשת במדבר - אהבת עולם אהבתיך (עברית)", {'entities': [(4, 13, 'SINGER')]}),
    ("חנני כי בא מועד איתמר כהן ורבי מיכל טאדסה זל", {'entities': [(16, 25, 'SINGER'), (31, 41, 'SINGER')]}),
    ("16 - אשת חיל - גל רובינסקי - [Windos.Co]", {'entities': [(15, 26, 'SINGER')]}),
    ("27 כבודו (עם אברהם מליחי)", {'entities': [(13, 24, 'SINGER')]}),
    ("שבת וואלץ -שי מסגנאו  2.314", {'entities': [(11, 20, 'SINGER')]}),
    ("- אבי ושמשון קדר - עתיד טוב יותר - מזרחי", {'entities': [(7, 16, 'SINGER')]}),
    ("ירחמיאל דאנה מגיש שוב ''א פרישע טאנץ 7''", {'entities': [(0, 12, 'SINGER')]}),
    ("יואל הרטמן בסינגל בכורה למילותיו של ר' נחמן מברסלב ''הדרך לרב'ה''", {'entities': [(0, 10, 'SINGER')]}),
    ("ליעד בק וסהר שיבר בביצוע נוסטלגי ''היום הרת עולם''", {'entities': [(0, 7, 'SINGER'), (9, 17, 'SINGER')]}),
    ("ראם צורף ואייל אניספלד - ריקוד הדברי ישראל ממודז'יץ", {'entities': [(0, 8, 'SINGER'), (10, 22, 'SINGER')]}),
    ("מחכה לשקט - אברהם קפלון", {'entities': [(12, 23, 'SINGER')]}),
    ("ילד הפלא מאיר פיינגולד 'אילן אילן' עם בנימין חי בשבע ברכות", {'entities': [(9, 22, 'SINGER'), (38, 47, 'SINGER')]}),
    ("זמן יעקב אמסל", {'entities': [(4, 13, 'SINGER')]}),
    ("73 רבי נהוראי שמואלי", {'entities': [(7, 20, 'SINGER')]}),
    ("עידו אלמקיס בסינגל קצבי ''נחמה כזו''", {'entities': [(0, 11, 'SINGER')]}),
    ("ידידיה טימן מגיש השיר התימני של האדמור", {'entities': [(0, 11, 'SINGER')]}),
    ("יקיר אדרי והמוזיקאי יואב בוני ''שרים אמונה''", {'entities': [(0, 9, 'SINGER'), (20, 29, 'SINGER')]}),
    ("הבדחן ראם צ'קול במצווה טאנץ", {'entities': [(6, 15, 'SINGER')]}),
    ("רועי גרבר & גיל אביהו - בית בישראל", {'entities': [(0, 9, 'SINGER'), (12, 21, 'SINGER')]}),
    ("- אורן נעים - בחור רגיש - מזרחי", {'entities': [(2, 11, 'SINGER')]}),
    ("אדיר לוי אומר תודה לאל בסינגל חדש ומקפיץ", {'entities': [(0, 8, 'SINGER')]}),
    ("13 ר' אילן אלון וחברים - זכרנו לחיים", {'entities': [(6, 15, 'SINGER')]}),
    ("האחים שמואלביץ' בסינגל שני חדש ''שמע ישראל''", {'entities': [(0, 15, 'SINGER')]}),
    ("06 - מחרוזת מבית בעלזא - יעקב סיבוני", {'entities': [(25, 36, 'SINGER')]}),
    ("מזל טוב רני הלוי", {'entities': [(8, 16, 'SINGER')]}),
    ("אריאל קורלנד וגיל רבין – קרב יום", {'entities': [(0, 12, 'SINGER'), (14, 22, 'SINGER')]}),
    ("הסיפור האחרון-עמית מס ויהונתן כהן", {'entities': [(14, 21, 'SINGER'), (23, 33, 'SINGER')]}),
    ("24 דרור יקרא - אבנר אבו", {'entities': [(15, 23, 'SINGER')]}),
    ("אורן נעים - נקודה של אור", {'entities': [(0, 9, 'SINGER')]}),
    ("אביתר רטנר 05", {'entities': [(0, 10, 'SINGER')]}),
    ("- איתי קרמר ואושר מנחם - וידעו כי אתה - חסידי", {'entities': [(2, 11, 'SINGER'), (13, 22, 'SINGER')]}),
    ("אלי חופי יושב ראש ראד בינת - כך הקמנו אימפריה", {'entities': [(0, 8, 'SINGER')]}),
    ("מאחורי השירים ב_זהו זה_ – המעבד ניסים ברץ", {'entities': [(32, 41, 'SINGER')]}),
    ("נדב רויטמן וידידים העולמית בלכה דודי", {'entities': [(0, 10, 'SINGER')]}),
    ("03-עשרה בני אדם -עם אריה גיגי", {'entities': [(20, 29, 'SINGER')]}),
    ("והתענג יהודה וויספיש", {'entities': [(7, 20, 'SINGER')]}),
    ("יהלי מעלם וניצן קופף א ישיבישע שמחה", {'entities': [(0, 9, 'SINGER'), (11, 20, 'SINGER')]}),
    ("הפיוט יפה ותמה יהודה ברקו le piyut yafa vetama moshe louk", {'entities': [(15, 25, 'SINGER')]}),
    ("תום ביטון מגיש ביצוע ווקאלי ללחן של קרליבך שומר ישראל", {'entities': [(0, 9, 'SINGER')]}),
    ("מחרוזת רפואה - נתן שפירו ונוי רזון העולמית", {'entities': [(15, 24, 'SINGER'), (26, 34, 'SINGER')]}),
    ("שידור חי של עירד נגר בקומזיץ שמחת חג לעמ''י", {'entities': [(12, 20, 'SINGER')]}),
    ("09 לא ישא גוי - בנימין קניאל", {'entities': [(16, 28, 'SINGER')]}),
    ("איתי לוי ב2 שירים לכבוד אלבומו החדש", {'entities': [(0, 8, 'SINGER')]}),
    ("נותן התורה - רונן דולינסקי ותמיר טל", {'entities': [(13, 26, 'SINGER'), (28, 35, 'SINGER')]}),
    ("מחרוזת חנוכה יונתן מויאל ואיתן אילני", {'entities': [(13, 24, 'SINGER'), (26, 36, 'SINGER')]}),
    ("איתי חיים ואדיר לוי בשיר ווקאלי ''בואי כלה''", {'entities': [(0, 9, 'SINGER'), (11, 19, 'SINGER')]}),
    ("אמנון קרן רבנו נחמן", {'entities': [(0, 9, 'SINGER')]}),
    ("שגיא גרמון בסינגל שני בסדרה ''לנגן ברוח''", {'entities': [(0, 10, 'SINGER')]}),
    ("הדף היומי מסכת בבא קמא דף קי''ג - קי''ד אדר א' תשפ''ד - שיעור בעברית מאת הרב יהונתן פטרזיל הי''ו מקול חי", {'entities': [(77, 90, 'SINGER')]}),
    ("מוצאי שבת נחמיה לרנר בני היכלא", {'entities': [(10, 20, 'SINGER')]}),
    ("פורימיקס שון שפיצר", {'entities': [(9, 18, 'SINGER')]}),
    ("אסף תמיר ובנו נתנאל עם שיר נוסף - שמע קולנו", {'entities': [(0, 8, 'SINGER')]}),
    ("בר פריאנטה – כי מציון תצא", {'entities': [(0, 10, 'SINGER')]}),
    ("אלון דגני - שיויתי", {'entities': [(0, 9, 'SINGER')]}),
    ("עידו אלמקיס בביצוע סוחף לצעקה של אייל בסטקר", {'entities': [(0, 11, 'SINGER'), (33, 43, 'SINGER')]}),
    ("דרור גולן בגירסה ווקאלית לשירו ''קצת ממך''", {'entities': [(0, 9, 'SINGER')]}),
    ("אבנר אפריאט וזוהר קרופרו בסינגל חדש ''חשוף''", {'entities': [(0, 11, 'SINGER'), (13, 24, 'SINGER')]}),
    ("מתן שמו משחרר כמעט שעה של ''הורה'' וניגוני ''מירון''", {'entities': [(0, 7, 'SINGER')]}),
    ("31 רבי יחיאל מינץ", {'entities': [(7, 17, 'SINGER')]}),
    ("רבי-גל רובינסקי", {'entities': [(4, 15, 'SINGER')]}),
    ("יאיר קשמה – ונתנה תוקף", {'entities': [(0, 9, 'SINGER')]}),
    ("סהר שיבר בביצוע ווקאלי של היצירה 'מודים' של החזן שי מסגנאו", {'entities': [(0, 8, 'SINGER'), (49, 58, 'SINGER')]}),
    ("כי נחם  אימרי שלוסברג דוד אליאב", {'entities': [(8, 21, 'SINGER'), (22, 31, 'SINGER')]}),
    ("פאר נח וישיבת שערי יצחק ''שובו אלי''", {'entities': [(0, 6, 'SINGER')]}),
    ("ישראל דרויאן - והכל טוב", {'entities': [(0, 12, 'SINGER')]}),
    ("דודי יוזוק יהלי קדמן ונהוראי שמואלי, מרגשים עם ברכת כהנים בשנחאי - סין,", {'entities': [(0, 10, 'SINGER'), (11, 20, 'SINGER'), (22, 35, 'SINGER')]}),
    ("עברתי בחושך-יוסף צברי", {'entities': [(12, 21, 'SINGER')]}),
    ("- ניר שטרית - הללו - מזרחי", {'entities': [(2, 11, 'SINGER')]}),
    ("ידידיה אבוחצירא ואהרון חג'בי במחרוזת ''מרקד'' סוערת", {'entities': [(0, 15, 'SINGER'), (17, 28, 'SINGER')]}),
    ("19 - קומזיץ עם אסף אבוטבול", {'entities': [(15, 26, 'SINGER')]}),
    ("יוסף פז & אורן מיזל במחרוזת 20 שירי ריבונו של עולם", {'entities': [(0, 7, 'SINGER'), (10, 19, 'SINGER')]}),
    ("סלח לי בני עזרא עוזרי", {'entities': [(11, 21, 'SINGER')]}),
    ("04-אופק חן", {'entities': [(3, 10, 'SINGER')]}),
    ("תומר סבח מארח את מקהלת שישו ושמחו ויואב סילם ''והיא שעמדה", {'entities': [(0, 8, 'SINGER'), (17, 33, 'SINGER'), (35, 44, 'SINGER')]}),
    ("יצחק צפרי - רפאנו השם", {'entities': [(0, 9, 'SINGER')]}),
    ("פנחס בוקובזה בסינגל אלולי חדש ''נחפשה''", {'entities': [(0, 12, 'SINGER')]}),
    ("04.אהבת קדומים - אהרון קפרא ויעקב בטיטו", {'entities': [(17, 27, 'SINGER'), (29, 39, 'SINGER')]}),
    ("בני ג'וסף מפתיע עם סינגל חדש ''בת מצווה''", {'entities': [(0, 9, 'SINGER')]}),
    ("בני חיי מזוני - אבנר גולה", {'entities': [(16, 25, 'SINGER')]}),
    ("יואב בוני - ארול", {'entities': [(0, 9, 'SINGER')]}),
    ("לביא גוטפריד מאחל ''חנוכה שמח'' בשיר חדש", {'entities': [(0, 12, 'SINGER')]}),
    ("אפיק סעד חוזר בסינגל חדש שומע תפילות", {'entities': [(0, 8, 'SINGER')]}),
    ("יצחק שיינרמן השיבנו", {'entities': [(0, 12, 'SINGER')]}),
    ("- עידו לובינסקי ואליה מזור - אני או אתה - מקורי", {'entities': [(2, 15, 'SINGER'), (17, 26, 'SINGER')]}),
    ("אברהם מליחי ואופק ריינר בקטע מרטיט נוסח ויז ניץ", {'entities': [(0, 11, 'SINGER'), (13, 23, 'SINGER')]}),
    ("סט מזרחי דתי 2022 שגיא פוקס", {'entities': [(18, 27, 'SINGER')]}),
    ("רבונו של עולם - אליהו מידן", {'entities': [(16, 26, 'SINGER')]}),
    ("שגיא אזולאי וראם צ'קול", {'entities': [(0, 11, 'SINGER'), (13, 22, 'SINGER')]}),
    ("דער סוכה זאב גפן ומתן שפר", {'entities': [(9, 16, 'SINGER'), (18, 25, 'SINGER')]}),
    ("אנטוני סלומון - רחם בחסדך", {'entities': [(0, 13, 'SINGER')]}),
    ("יעקב מגידש - תתארו לכם", {'entities': [(0, 10, 'SINGER')]}),
    ("יצחק ביגל בסינגל חדש -''לכה דודי''", {'entities': [(0, 9, 'SINGER')]}),
    ("07-ונא ונא - להקת אש ומים", {'entities': [(13, 25, 'SINGER')]}),
    ("יונתן מוטיעי בסינגל חדש ''תחת יריעת שמים''", {'entities': [(0, 12, 'SINGER')]}),
    ("שחר כהן ואליעזר שמיר בסינגל חדש לחנוכה הנרות הללו", {'entities': [(0, 7, 'SINGER'), (9, 20, 'SINGER')]}),
    ("אבישי חדד _ אברהם טפירו - וספור הכוכבים", {'entities': [(0, 9, 'SINGER'), (12, 23, 'SINGER')]}),
    ("גלעד פרטר בסינגל תוסס ''אילו פינו''", {'entities': [(0, 9, 'SINGER')]}),
    ("יובל כהן בבלדה חורפית מרגשת ''רק תגדל''", {'entities': [(0, 8, 'SINGER')]}),
    ("רותם נח בקאבר לזכרו של הרב קנייבסקי זצוק''ל ''גדולי הדור''", {'entities': [(0, 7, 'SINGER')]}),
    ("אוהד רחבי ואריאל טבול לשיר של מרק ויזגן ''ויהיו זרעי''", {'entities': [(0, 9, 'SINGER'), (11, 21, 'SINGER'), (30, 39, 'SINGER')]}),
    ("שלום גרמאי - שוכן עד", {'entities': [(0, 10, 'SINGER')]}),
    ("יועד סויסה ורועי עיני עם מחרוזת ניגוני חבד", {'entities': [(0, 10, 'SINGER'), (12, 21, 'SINGER')]}),
    ("07.ריבון - אופיר שפיגל ורועי גרבר", {'entities': [(11, 22, 'SINGER'), (24, 33, 'SINGER')]}),
    ("יובל חבקוק & שי מוגס - אילן", {'entities': [(0, 10, 'SINGER'), (13, 20, 'SINGER')]}),
    ("מור שניידר, בועז איילה, אייל אניספלד מרגשים ''מאמע רחל''", {'entities': [(0, 10, 'SINGER'), (12, 22, 'SINGER'), (24, 36, 'SINGER')]}),
    ("יהונתן פליי_ מלחין מוסיקה ומעצב פסקול למשחקי מחשב", {'entities': [(0, 11, 'SINGER')]}),
    ("חיים זליקוביץ - מחרוזת כורדית", {'entities': [(0, 13, 'SINGER')]}),
    ("01-לטובה-טל פוגל", {'entities': [(9, 16, 'SINGER')]}),
    ("שיר השירים אורי צמח", {'entities': [(11, 19, 'SINGER')]}),
    ("שמחה פורצת גבולות 10# - אבישי זקצר", {'entities': [(24, 34, 'SINGER')]}),
    ("מתי הוא יגיע לביא חדד", {'entities': [(13, 21, 'SINGER')]}),
    ("06 תנא דבי -אלירן סבן", {'entities': [(12, 21, 'SINGER')]}),
    ("שנות אור אוריה סממה", {'entities': [(9, 19, 'SINGER')]}),
    ("ר' אביב רואס ושירה במחרוזת חתונה", {'entities': [(3, 12, 'SINGER')]}),
    ("אופק מתן - אל אדון", {'entities': [(0, 8, 'SINGER')]}),
    ("שמעון פיק - Fresh", {'entities': [(0, 9, 'SINGER')]}),
    ("ליעד בק שר לראשונה בן תורה", {'entities': [(0, 7, 'SINGER')]}),
    ("מיזם 'קפיצת הדרך' לכבוד סוכות ''ושמחת בחגיך'' של אוהד מוגילבסקי", {'entities': [(49, 63, 'SINGER')]}),
    ("יהונתן גובי - סימן שהכל טוב", {'entities': [(0, 11, 'SINGER')]}),
    ("מיכל טאדסה יובל סיביליה ובנימין אורלן ''א אידישע חופה''", {'entities': [(0, 10, 'SINGER'), (11, 23, 'SINGER'), (25, 37, 'SINGER')]}),
    ("09 - אמיתי אלבז ואברהם קפלון", {'entities': [(5, 15, 'SINGER'), (17, 28, 'SINGER')]}),
    ("04 מחרוזת מחווה קרליבך - איתי גלינסקי , יובל שפיגלמן שאול פנחסוב רובי הרי", {'entities': [(25, 37, 'SINGER'), (40, 52, 'SINGER'), (53, 64, 'SINGER')]}),
    ("משה אזולאי וידידים - ואפילו בהסתרה", {'entities': [(0, 10, 'SINGER')]}),
    ("עידו פולק ורונן שגב - יוונים נקבצו עלי", {'entities': [(0, 9, 'SINGER'), (11, 19, 'SINGER')]}),
    ("משה בוזגלו מגישה יצירה מרהיבה 21 הפתיחים הגדולים של מונה", {'entities': [(0, 10, 'SINGER')]}),
    ("חיים אלמלך, נפתלי גרפל, עומר שגב, ליר אזולוס, אמיר בנימין, זיו אלמקיאס - לכה דודי - קבלת שבת בצפת", {'entities': [(0, 10, 'SINGER'), (12, 22, 'SINGER'), (24, 32, 'SINGER'), (34, 44, 'SINGER'), (46, 57, 'SINGER'), (59, 70, 'SINGER')]}),
    ("ראש חודש כסל  יוסף ווסקובויניקוב במחרוזת 'חשוף'", {'entities': [(14, 32, 'SINGER')]}),
    ("אריאל ביסטרוב", {'entities': [(0, 13, 'SINGER')]}),
    ("מנחם אזרן ויעקב איתמר בסינגל בכורה ''הוא יקים''", {'entities': [(0, 9, 'SINGER'), (11, 21, 'SINGER')]}),
    ("שמואל קיפגן - אבא נשמה", {'entities': [(0, 11, 'SINGER')]}),
    ("09-ניגון לר' גיל בן-ארי", {'entities': [(13, 23, 'SINGER')]}),
    ("אילן עני ומאיר פרץ בביצע וואקלי אנא בכוח  - עותק", {'entities': [(0, 8, 'SINGER'), (10, 18, 'SINGER')]}),
    ("מרדכי פארי בשיחת חג מיוחדת ומרתקת עם גבריאל טובול", {'entities': [(0, 10, 'SINGER'), (37, 49, 'SINGER')]}),
    ("Hold On Tight - אלון שרביט וכוכבי הזמר", {'entities': [(16, 26, 'SINGER')]}),
    ("אברהם קופולוביץ וגל רוט ביצעו את הלהיט נפשי", {'entities': [(0, 15, 'SINGER'), (17, 23, 'SINGER')]}),
    ("חיים הרפז בסינגל בכורה אישי - שויתי", {'entities': [(0, 9, 'SINGER')]}),
    ("מקהלת בית רבן והכליזמרים – שמח תשמח", {'entities': [(0, 13, 'SINGER')]}),
    ("ראם צורף משחרר סינגל חדש באווירת הימים ''אל תתעלם''", {'entities': [(0, 8, 'SINGER')]}),
    ("בניה בורובסקי משיק אלבום סולו ראשון, זאג שוין ווען", {'entities': [(0, 13, 'SINGER')]}),
    ("עומר ברמי, עומר יוסף ומאיר אוזן שרים אלו ואלו", {'entities': [(0, 9, 'SINGER'), (11, 20, 'SINGER'), (22, 31, 'SINGER')]}),
    ("עידן בוחבוט שר, רפי הרקדן מדגים ריקוד צמאה תשפב", {'entities': [(0, 11, 'SINGER')]}),
    ("הרב אילן אלון ורוי ווסה בקאבר נוסטלגי 'ידיד נפש'", {'entities': [(4, 13, 'SINGER'), (15, 23, 'SINGER')]}),
    ("שיר הגאולה שמשון קדר", {'entities': [(11, 20, 'SINGER')]}),
]


for text, annots in data:
    doc = nlp.make_doc(text)
    examples.append(Example.from_dict(doc, annots))
print(nlp.evaluate(examples))



def analyze_errors(nlp, data):
    errors = []
    for text, true_entities in data:
        # Filter entities to include only 'SINGER'
        true_entities_filtered = [
            (start, end, label) for start, end, label in true_entities['entities'] if label == 'SINGER'
        ]
        doc = nlp(text)
        pred_entities_filtered = [
            (ent.start_char, ent.end_char, ent.label_) for ent in doc.ents if ent.label_ == 'SINGER'
        ]

        # Check for false positives and false negatives
        for start, end, label in set(pred_entities_filtered + true_entities_filtered):
            pred = (start, end, label) in pred_entities_filtered
            true = (start, end, label) in true_entities_filtered

            if pred != true:
                error_type = "False Positive" if pred else "False Negative"
                errors.append({
                    "text": text,
                    "error_type": error_type,
                    "entity": text[start:end],
                    "start": start,
                    "end": end,
                    "label": label
                })

    return errors


errors = analyze_errors(nlp, data)

print("\nIncorrect Identifications:")
for error in errors:
    print(f"Text: {error['text']}")
    print(f"Error Type: {error['error_type']}")
    print(f"Entity: {error['entity']}")
    print(f"Position: {error['start']}:{error['end']}")
    #print(f"Label: {error['label']}")
    print()

print(f"Total errors: {len(errors)}")