import spacy
from spacy.training.example import Example

# read name of model
with open("model_name.txt", 'r', encoding='utf-8') as f:
    model_name = f.read()
    print(f'# {model_name}')

# Load your trained model
nlp = spacy.load(model_name)


examples = []
data = [
("'פנחס בוקובזה' והחברים בקומזיץ 'הבדלה' מושקע", {'entities': [(1, 13, 'SINGER')]}),
("מתן שמו - אנחנו טובים", {'entities': [(0, 7, 'SINGER')]}),
("שמעון פיק ואריאל טבול מגישים קאבר ''משיח''", {'entities': [(0, 9, 'SINGER'), (11, 21, 'SINGER')]}),
("יהונתן פליי משחרר שיר ''אלוקיי'' מאלבומו החדש ''אז ישיר''", {'entities': [(0, 11, 'SINGER')]}),
("אילן עני מגיש סינגל חדש בשם ''נופל שדוד''", {'entities': [(0, 8, 'SINGER')]}),
("אורן מיזל במחרוזת משובחת בשם ''השפעות מוצאי שבת''", {'entities': [(0, 9, 'SINGER')]}),
("ניסים ברץ ואריאל ביסטרוב במחרוזת קסומה עם מיטב שירי ר''ח", {'entities': [(0, 9, 'SINGER'), (11, 24, 'SINGER')]}),
("יעקב אמסל - ירושלים", {'entities': [(0, 9, 'SINGER')]}),
("דרור גולן - אל נקמות ה", {'entities': [(0, 9, 'SINGER')]}),
("עידו דניאלי הלחין ושר ''אשת חיל''", {'entities': [(0, 11, 'SINGER')]}),
("יגיע זמן - אביב רואס", {'entities': [(11, 20, 'SINGER')]}),
("אייל בסטקר - רוצה", {'entities': [(0, 10, 'SINGER')]}),
("זוהר קרופרו-קרוב-מתמיד1", {'entities': [(0, 11, 'SINGER')]}),
("אדיר לוי בסינגל עוצמתי ומחבר ''אל תוותר''", {'entities': [(0, 8, 'SINGER')]}),
("רונן דולינסקי מפתיע ומשחרר סינגל חדש בסטייל השמור רק לו ''מודים''", {'entities': [(0, 13, 'SINGER')]}),
("אילן אלון ואורן נעים שרים שוובר ועל חסדך", {'entities': [(0, 9, 'SINGER'), (11, 20, 'SINGER')]}),
("אימרי שלוסברג - מחרוזת לב & נשמה", {'entities': [(0, 13, 'SINGER')]}),
("בר פריאנטה בסינגל בכורה חדש ''אני פה להישאר''", {'entities': [(0, 10, 'SINGER')]}),
("ליפא’ס ערשטע טאנץ - יואב סילם", {'entities': [(20, 29, 'SINGER')]}),
("נהוראי שמואלי לא נח לרגע ומגיש מחרוזת חופה מרגשת עם מיטב הלהיטים", {'entities': [(0, 13, 'SINGER')]}),
("אסף אבוטבול  - גוט מארגן", {'entities': [(0, 11, 'SINGER')]}),
("אבנר גולה, יונתן מויאל וגדולי הזמר בסדרת חופה מרהיבה ''ברוך הבא''", {'entities': [(0, 9, 'SINGER'), (11, 22, 'SINGER')]}),
("עירד נגר ותזמורתו של אליהו מידן במחרוזת ''שירי שלמה''", {'entities': [(0, 8, 'SINGER'), (21, 31, 'SINGER')]}),
("אביתר רטנר מפתיע בסינגל חדש ''לבוש שחורים''", {'entities': [(0, 10, 'SINGER')]}),
("עידו מזוז והמכונות - מרבים בשמחה", {'entities': [(0, 9, 'SINGER')]}),
("גבריאל טובול בסינגל חדש ''כבד את אביך''", {'entities': [(0, 12, 'SINGER')]}),
("רוי ווסה משיק סינגל חדש מעומק הלב ''נחלי דמעות''", {'entities': [(0, 8, 'SINGER')]}),
("יהונתן גובי ואביו עילאי לוי בסינגל חדש ''געבליבן מיט דיר''", {'entities': [(0, 11, 'SINGER'), (18, 27, 'SINGER')]}),
("אליעזר שמיר במחרוזת להיטי מיכל טאדסה", {'entities': [(0, 11, 'SINGER'), (26, 36, 'SINGER')]}),
("ניצן קופף והחברים בשירה שכולו ערגה וכיסופין ''שלשידעס''", {'entities': [(0, 9, 'SINGER')]}),
("להקת אש ומים - והערב נא", {'entities': [(0, 12, 'SINGER')]}),
("תומר סבח - תמיד אוהב אותי", {'entities': [(0, 8, 'SINGER')]}),
("אוריה סממה - גם כי אלך (קאבר עטלף עיוור)", {'entities': [(0, 10, 'SINGER')]}),
("משה בוזגלו - חופה ליד", {'entities': [(0, 10, 'SINGER')]}),
("יעקב איתמר - בא לי", {'entities': [(0, 10, 'SINGER')]}),
("אמנון קרן - באה השמחה", {'entities': [(0, 9, 'SINGER')]}),
("Joey-Newcomb-Kaeileh-יונתן מוטיעי-כאלה", {'entities': [(21, 33, 'SINGER')]}),
("יהודה ברקו יעקב מגידש אלוקי נשמה MP3", {'entities': [(0, 10, 'SINGER'), (11, 21, 'SINGER')]}),
("אשריכם תלמידי חכמים - אלי חופי - ווקאלי", {'entities': [(22, 30, 'SINGER')]}),
("ניר שטרית - הטוב ישאר", {'entities': [(0, 9, 'SINGER')]}),
("גל רובינסקי - מימיני מיכאל", {'entities': [(0, 11, 'SINGER')]}),
("דוד אליאב - לך על זה", {'entities': [(0, 9, 'SINGER')]}),
("אופק ריינר - באתי לגני", {'entities': [(0, 10, 'SINGER')]}),
("יהונתן פטרזיל - ישתבח שמך", {'entities': [(0, 13, 'SINGER')]}),
("מור שניידר ומרדכי יצחקי - מסלסלים", {'entities': [(0, 10, 'SINGER'), (12, 23, 'SINGER')]}),
("אמיתי אלבז - אני יהודי", {'entities': [(0, 10, 'SINGER')]}),
("בועז איילה - כדאי ר' שמעון", {'entities': [(0, 10, 'SINGER')]}),
("עידו לובינסקי & נוי רזון - מחרוזת ריקודים", {'entities': [(0, 13, 'SINGER'), (16, 24, 'SINGER')]}),
("מלך מלכי המלכים עומר ברמי", {'entities': [(16, 25, 'SINGER')]}),
("אבישי זקצר .שדרן שיר", {'entities': [(0, 10, 'SINGER')]}),
("אבנר אפריאט & רני הלוי - כי אנו עמך", {'entities': [(0, 11, 'SINGER'), (14, 22, 'SINGER')]}),
("יהונתן כהן - מאמא דיאלי", {'entities': [(0, 10, 'SINGER')]}),
("אברהם קופולוביץ - אל מסתתר", {'entities': [(0, 15, 'SINGER')]}),
("אייל אניספלד - נסיעה ארוכה", {'entities': [(0, 12, 'SINGER')]}),
("יובל חבקוק גדול השלום", {'entities': [(0, 10, 'SINGER')]}),
("ניגוני יהודה (עומר גלילי) triste esta el rey david", {'entities': [(14, 24, 'SINGER')]}),
("נתנאל & נדב רויטמן והיא שעמדה", {'entities': [(8, 18, 'SINGER')]}),
("סט 2019  דיגי אברהם טפירו (320  kbps) (vipman.xyz)", {'entities': [(14, 25, 'SINGER')]}),
("יואל הרטמן סינגל", {'entities': [(0, 10, 'SINGER')]}),
("עידו פולק עם מדרשת תפארת בחורים - אתיתי לחננך", {'entities': [(0, 9, 'SINGER')]}),
("יחיאל מינץ ויוסף ווסקובויניקוב חזו בני", {'entities': [(0, 10, 'SINGER'), (12, 30, 'SINGER')]}),
("אופק מתן & אלירן ווקנין - הושיע אותנו", {'entities': [(0, 8, 'SINGER'), (11, 23, 'SINGER')]}),
("אפיק סעד וזיו אלמקיאס מקפיצים", {'entities': [(0, 8, 'SINGER'), (10, 21, 'SINGER')]}),
("נחמיה לרנר - עננו - anenu - sruli ginsberg", {'entities': [(0, 10, 'SINGER')]}),
("גיל אביהו - והלוואי - Tamir Mizrachi - Vehalevai", {'entities': [(0, 9, 'SINGER')]}),
("ברכת המזון המנגינה שהלחין דניאל שנטל", {'entities': [(26, 36, 'SINGER')]}),
("אריאל קורלנד - במסע החיים", {'entities': [(0, 12, 'SINGER')]}),
("יקיר אדרי שיפקדוני", {'entities': [(0, 9, 'SINGER')]}),
("מאיר פיינגולד ובנימין קניאל ''ידע כל פעול''", {'entities': [(0, 13, 'SINGER'), (15, 27, 'SINGER')]}),
("זיו כהן ואיתי קרמר מרגשים במחרוזת ''ימים נוראים''", {'entities': [(0, 7, 'SINGER'), (9, 18, 'SINGER')]}),
("סהר שיבר, אנטוני סלומון - אני מאמין", {'entities': [(0, 8, 'SINGER'), (10, 23, 'SINGER')]}),
("נחמן ואליה מזור - ניגון וזמרה", {'entities': [(6, 15, 'SINGER')]}),
("יוסף צברי בסינגל חדש לימים הנוראים ''אבינו מלכנו''", {'entities': [(0, 9, 'SINGER')]}),
("חיים כהן, טל פוגל - האיש מוילנא", {'entities': [(0, 8, 'SINGER'), (10, 17, 'SINGER')]}),
("בני ג'וסף, מקהלת שישו ושמחו - כי הנה כחומר", {'entities': [(0, 9, 'SINGER'), (11, 27, 'SINGER')]}),
("אברהם מליחי - האזינו", {'entities': [(0, 11, 'SINGER')]}),
("שגיא גרמון & גל רוט - תשרי מיקס", {'entities': [(0, 10, 'SINGER'), (13, 19, 'SINGER')]}),
("יאיר קשמה - מצוה טאנץ מושלם", {'entities': [(0, 9, 'SINGER')]}),
("יעקב סיבוני & יובל שפיגלמן - בריה אחת", {'entities': [(0, 11, 'SINGER'), (14, 26, 'SINGER')]}),
("מתן שפר & עמית מס - שופט כל הארץ", {'entities': [(0, 7, 'SINGER'), (10, 17, 'SINGER')]}),
("איתמר סיטבון - דאס לעצטע דוכנ'ען", {'entities': [(0, 12, 'SINGER')]}),
("Arik Einstein יובל כהן לפעמים(MP3_320K)", {'entities': [(14, 22, 'SINGER')]}),
("בנימין אורלן - עוד דקה את נעלמת(MP3_160K)", {'entities': [(0, 12, 'SINGER')]}),
("תום ביטון ויהודה וויספיש - עוד דקה את נעלמת(MP3_320K)", {'entities': [(0, 9, 'SINGER'), (11, 24, 'SINGER')]}),
("נתן ארזי - מיכל(MP3_320K)", {'entities': [(0, 8, 'SINGER')]}),
("גלעד פרטר - הגולה - Dudu Tassa - Hagole(MP3_320K)", {'entities': [(0, 9, 'SINGER')]}),
("עזרא עוזרי - הלא נודע(MP3_320K)", {'entities': [(0, 10, 'SINGER')]}),
("אוהד רחבי ועומר יוסף - זאת שמעל למצופה(MP3_320K)", {'entities': [(0, 9, 'SINGER'), (11, 20, 'SINGER')]}),
("נתן שפירו - זאת שמעל לכל המצופה(MP3_320K)", {'entities': [(0, 9, 'SINGER')]}),
("הכוכב הבא 2022 -- שגיא אזולאי - זאת שמעל לכל המצופה(MP3_320K)", {'entities': [(18, 29, 'SINGER')]}),
("אלחנן מאיר - חופים הם לפעמים(MP3_320K)", {'entities': [(0, 10, 'SINGER')]}),
("יהודה טורקניץ ומנחם אזרן - סהרה (חי בלייב פארק)(MP3_320K)", {'entities': [(0, 13, 'SINGER'), (15, 24, 'SINGER')]}),
("שגיא פוקס - חופים הם לפעמים(MP3_320K)", {'entities': [(0, 9, 'SINGER')]}),
("פול טראנק עם פאר נח - סתלבט בקיבוץ(MP3_320K)", {'entities': [(13, 19, 'SINGER')]}),
("מאיר אוזן מעלה מעלה Svika Pick(MP3_320K)", {'entities': [(0, 9, 'SINGER')]}),
("אוהד מוגילבסקי לא_נרגע_Avihai_Hollender_Lo_Nirga", {'entities': [(0, 14, 'SINGER')]}),
("איתי לוי, איתי גלינסקי ונועם שמחון - רואים רחוק רואים שקוף", {'entities': [(0, 8, 'SINGER'), (10, 22, 'SINGER'), (24, 34, 'SINGER')]}),
("האחים שמואלביץ' וזה יבוא אתה תראה", {'entities': [(0, 15, 'SINGER')]}),
("דודי יוזוק אצלנו בגן", {'entities': [(0, 10, 'SINGER')]}),
("רונן שגב...לכה דודי", {'entities': [(0, 8, 'SINGER')]}),
]



for text, annots in data:
    doc = nlp.make_doc(text)
    examples.append(Example.from_dict(doc, annots))
print(nlp.evaluate(examples))

"""
for key, value in results.items():
    if not value is None and not value == 0.0 and not value == {}:
        print(f"{key:<5}: {value}")
"""