[
  {
    "type": "טיפ",
    "title": "שמירת העדפות",
    "content": "לאחר שבחרת אפשרויות כמו 'העבר קבצים' או 'העתק קבצים', אל תשכח ללחוץ על כפתור השמירה בהגדרות. כך לא תצטרך להגדיר הכל מחדש בפעם הבאה."
  },
  {
    "type": "הידעת",
    "title": "זיהוי אמנים",
    "content": "התוכנה מנסה לזהות את שם האמן לפי שם הקובץ ופרטי השיר. לכן, גם אם השם לא רשום בדיוק כמו שצריך – עדיין יתכן שהיא תזהה אותו."
  },
  {
    "type": "טיפ",
    "title": "סריקת תיקיות פנימיות",
    "content": "אם תרצה שהתוכנה תסרוק גם תיקיות משנה בתוך תיקיית המקור, ודא שהמתג 'סרוק עץ תיקיות' פועל בהגדרות הבסיסיות."
  },
  {
    "type": "טיפ",
    "title": "הוספת זמרים חדשים",
    "content": "במסך ההגדרות המתקדמות, תוכל להוסיף בעצמך אמנים שלא זוהו ולהגדיר איך תיקיית האמן תיקרא. חשוב למלא גם את שם הזמר וגם את שם התיקיה."
  },
  {
    "type": "טיפ",
    "title": "תיקון שמות הקבצים",
    "content": "בלחיצה על 'תקן שמות', התוכנה תסיר כיתובים שיווקיים, תתקן ג'יבריש ותסדר את שם הקובץ בצורתו הנקייה ביותר."
  },
  {
    "type": "הידעת",
    "title": "בדיקת עדכון אוטומטית",
    "content": "התוכנה בודקת אם יצאה גרסה חדשה; אם תראה סמל עדכון בתפריט, סימן שיש גרסה חדשה זמינה להורדה."
  },
  {
    "type": "טיפ",
    "title": "ההבדל בין העברה להעתקה",
    "content": "העברה מעבירה את הקובץ לחלוטין לתיקיית היעד ומפנה מקום במקור, בעוד העתקה תשאיר עותק גם בתיקיית המקור."
  },
  {
    "type": "טיפ",
    "title": "הגדרת 'צור תיקיות סינגלים'",
    "content": "כדי להפריד בין אלבומים שלמים לסינגלים בודדים, הפעל את האפשרות 'צור תיקיות סינגלים'. כך ייווצרו תיקיות סינגלים תחת כל אמן."
  },
  {
    "type": "טיפ",
    "title": "מיון אלפביתי",
    "content": "בסעיף ההגדרות המתקדמות, ניתן לבחור 'מיון אלפביתי', וכך התוכנה תיצור תיקיות ראשיות לפי האות הראשונה של שם האמן."
  },
  {
    "type": "טיפ",
    "title": "שימוש בתיקיות קיימות בלבד",
    "content": "אם לא תרצה שהתוכנה תיצור תיקיות חדשות, סמן 'שימוש בתיקיות קיימות בלבד'. כך הקבצים ימוינו רק לתיקיות שכבר ישנן בתיקיית היעד."
  },
  {
    "type": "טיפ",
    "title": "לא ניתן לבטל תהליך באמצע",
    "content": "לפני שמתחילים למיין או לתקן שמות, וודא שבחרת את התיקיות הנכונות. לאחר שהמיון החל, אין דרך לעצור אותו בלי לסגור את התוכנה."
  },
  {
    "type": "הצעה",
    "title": "הגדרת מיון דואטים",
    "content": "בהגדרות המתקדמות תוכל לבחור האם שיר משותף (דואט) יעבור לכל תיקיות האמנים או רק לתיקיה של האמן הראשון."
  },
  {
    "type": "טיפ",
    "title": "מיון רק של התיקייה הראשית",
    "content": "אם תרצה שהמיון יתבצע אך ורק על התיקייה שבחרת ללא תיקיות המשנה, כבה את 'סרוק עץ תיקיות' בהגדרות הבסיסיות."
  },
  {
    "type": "הידעת",
    "title": "זיהוי אלבומים שלמים",
    "content": "התוכנה מזהה תיקייה עם 3 שירים לפחות כאלבום, ומקצה לה תיקיה ייחודית לאמן ולשם האלבום, אם המטאדאטה עקבית."
  },
  {
    "type": "טיפ",
    "title": "הסרה אוטומטית של מילים שיווקיות",
    "content": "ברגע שתפעיל 'תקן שמות', מילים כמו 'חדשות המוזיקה' ו'מייל מיוזיק' יוסרו משמות הקבצים. ככה השם נהיה ברור וענייני."
  },
  {
    "type": "טיפ",
    "title": "עיצוב שם הקובץ",
    "content": "התוכנה מוחקת קווים תחתונים ומקפים המחוברים לאותיות, ומחליפה אותם ברווח במידת הצורך. כך מתקבל שם קובץ מסודר."
  },
  {
    "type": "הידעת",
    "title": "כפתור 'מיין שירים'",
    "content": "לחיצה אחת על 'מיין שירים' וכולם יועברו לתיקיות האמן הרלוונטיות לפי השם והפרטים. חוסך הרבה זמן חיפוש ידני."
  },
  {
    "type": "טיפ",
    "title": "הוספת זמר דרך ממשק 'הגדרות מתקדמות'",
    "content": "אם התוכנה לא מזהה זמר, פתח את החלונית 'הוספת זמרים' בהגדרות מתקדמות והוסף אותו לרשימה, כך שתיקיית האמן תיקרא כמו שתרצה."
  },
  {
    "type": "הצעה",
    "title": "אחידות אלבום",
    "content": "כאשר התוכנה מוצאת תיקייה עם שם אלבום עקבי לכל הקבצים, היא תיצור תיקייה מסודרת עם שם האלבום ותשמור בה את כל השירים."
  },
  {
    "type": "הידעת",
    "title": "ניטור קבצים בשמות מוזרים",
    "content": "התוכנה מנסה להתגבר אפילו על שמות ג'יבריש. אם מצאת קבצים שלא תוקנו, נסה להפעיל שוב את 'תקן שמות' או להוסיף עוד זמרים ידנית."
  },
  {
    "type": "טיפ",
    "title": "בדיקת התקינות לפני מיון",
    "content": "לפני שאתה לוחץ על 'מיין שירים', מומלץ לוודא שיש לך גיבוי ולבדוק שבחרת את תיקיות המקור והיעד הנכונות."
  },
  {
    "type": "הצעה",
    "title": "מיון דואטים חלקי",
    "content": "אם אינך רוצה שבכל דואט הקובץ יעבור למספר תיקיות אמנים, בחר ב'העתק לזמר הראשון בשם השיר', כדי לצמצם כפילויות."
  },
  {
    "type": "טיפ",
    "title": "הגדרות מתקדמות נוספות",
    "content": "בהגדרות המתקדמות תוכל גם לייבא או לייצא רשימות זמרים. זה מועיל אם אתה עובד עם אוסף גדול ורוצה לשתף עם חברים."
  },
  {
    "type": "הידעת",
    "title": "שמירת קובץ רשימת זמרים",
    "content": "כשתערוך את הרשימה בהגדרות המתקדמות, התוכנה יוצרת עבורך קובץ פנימי עם שמות הזמרים. כך גם אם השמות לא קיימים בשוק, תוכל לשמור אותם לשימוש חוזר."
  },
  {
    "type": "טיפ",
    "title": "צפייה בסיכום המיון",
    "content": "לאחר כל פעולה של 'מיין שירים', תופיע הודעה המסכמת כמה שירים מוינו, כמה תיקיות נוצרו ומיהם חמשת האמנים המובילים."
  },
  {
    "type": "הצעה",
    "title": "למיין ואז לתקן שמות",
    "content": "לפעמים נוח קודם למיין לתיקיות לפי האמנים, ורק אחרי זה ללחוץ על 'תקן שמות' כדי לנקות את כל השמות שנמצאו באותה תיקייה."
  },
  {
    "type": "הידעת",
    "title": "חיפוש אמנים שאינם ברשימה",
    "content": "אם התוכנה לא מוצאת התאמה של אמן, היא תנסה לנתח את שם הקובץ או הפרטים המוטבעים בקובץ כדי לאתר מידע על האמן."
  },
  {
    "type": "טיפ",
    "title": "סנן תיקיות קיימות",
    "content": "אם כבר סידרת תיקיות ידנית ומעדיף שהתוכנה לא תיצור חדשות, חשוב מאוד לבדוק ש'שימוש בתיקיות קיימות' פעיל."
  },
  {
    "type": "טיפ",
    "title": "הכנת הספרייה מראש",
    "content": "כדי לחסוך זמן, כדאי לשמור את כל קבצי המוזיקה המבולגנים במקום אחד (תיקיית המקור) ולבחור באיזו תיקיית יעד התוכנה תסדר אותם."
  },
  {
    "type": "הידעת",
    "title": "מיון מינימלי",
    "content": "אם בתיקייה יש פחות מ-3 קבצי מוזיקה, התוכנה בדרך כלל לא מתייחסת אליה כאל אלבום ותמיין את הקבצים בנפרד."
  },
  {
    "type": "טיפ",
    "title": "נוחות ממשק",
    "content": "כל הכפתורים וההגדרות ממוקמים כך שתוכל למצוא אותם בקלות. היכנס להגדרות המתקדמות רק אם אתה צריך אפשרויות נוספות."
  },
  {
    "type": "הצעה",
    "title": "גיבוי לפני פעולות גדולות",
    "content": "מומלץ בחום ליצור עותק גיבוי של תיקיית המוזיקה לפני שמפעילים את התוכנה בפעם הראשונה על אוסף גדול."
  }
]
