[
  {
    "type": "טיפ",
    "content": "כדי לשמור את ההעדפות שלך להמשך, כמו בחירה בין 'העברה' ל'העתקה', לחץ על כפתור השמירה. כך תחסוך זמן בהגדרות הבאות."
  },
  {
    "type": "טיפ",
    "content": "אם תרצה שהתוכנה תסרוק גם תיקיות פנימיות, ודא שהאפשרות 'סרוק עץ תיקיות' מופעלת בהגדרות."
  },
  {
    "type": "הידעת?",
    "content": "התוכנה מנתחת את שם הקובץ והפרטים המוטמעים בו כדי לזהות אמן, גם אם השם אינו מדויק."
  },
  {
    "type": "טיפ",
    "content": "ניתן להוסיף אמנים באופן ידני דרך ההגדרות המתקדמות. כך תוכל להבטיח שהתוכנה תזהה את הקבצים בצורה נכונה."
  },
  {
    "type": "טיפ",
    "content": "שימוש באפשרות 'תקן שמות' יאפשר להסיר מילים מיותרות, לתקן ג'יבריש ולסדר את שם הקובץ בצורה נקייה."
  },
  {
    "type": "הידעת?",
    "content": "התוכנה בודקת אוטומטית אם יש גרסה חדשה זמינה. אם מופיע סמל עדכון, כדאי להוריד את הגרסה העדכנית."
  },
  {
    "type": "טיפ",
    "content": "בחר 'העברה' אם תרצה להעביר קבצים לתיקיית היעד ולפנות מקום במקור. בחר 'העתקה' אם תרצה לשמור עותק נוסף."
  },
  {
    "type": "טיפ",
    "content": "שימוש באפשרות 'צור תיקיות סינגלים' יאפשר להפריד בין אלבומים לסינגלים, ולשמור אותם תחת תיקיות נפרדות."
  },
  {
    "type": "טיפ",
    "content": "תוכל למיין את תיקיות האמנים לפי האות הראשונה של שמם על ידי הפעלת האפשרות 'מיון אלפביתי' בהגדרות."
  },
  {
    "type": "הצעה",
    "content": "בחר אם לשמור דואטים בכל תיקיות האמנים המשתתפים או רק בתיקיית האמן הראשון, דרך ההגדרות המתקדמות."
  },
  {
    "type": "טיפ",
    "content": "אם אינך מעוניין שהתוכנה תיצור תיקיות חדשות, ודא שהאפשרות 'שימוש בתיקיות קיימות בלבד' מופעלת."
  },
  {
    "type": "טיפ",
    "content": "לפני מיון קבצים, ודא שגיבית את התיקיות שלך כדי למנוע אובדן נתונים במקרה של טעות."
  },
  {
    "type": "הידעת?",
    "content": "התוכנה מזהה תיקיות עם לפחות 3 שירים כאלבומים, וממיינת אותן בהתאם לאמן ולשם האלבום."
  },
  {
    "type": "טיפ",
    "content": "התוכנה מותאמת לשימוש קל ומהיר. אם דרושות לך אפשרויות מתקדמות, תוכל לגשת אליהן בהגדרות המתקדמות."
  },
  {
    "type": "הצעה",
    "content": "אם אתה מתכוון למיין או לתקן אוסף גדול של קבצים, מומלץ ליצור עותק גיבוי של התיקייה."
  }
]
