def jibrish_to_hebrew(string):
    """
פונקציה שממירה מחרוזת משובשת לעברית
ניתן להכניס מחרוזת בעברית על מנת להמירה לג'יבריש ולהפך

פרמטרים:
פרמטר 1 = מחרוזת בעברית משובשת
    """

    # הגדרת מילונים להמרה מעברית לגי'בריש ולהפך
    heb_to_jib = {'א': 'à', 'ב': 'á', 'ג': 'â', 'ד': 'ã', 'ה': 'ä', 'ו': 'å', 'ז': 'æ', 'ח': 'ç', 'ט': 'è', 'י': 'é', 'כ': 'ë', 'ל': 'ì', 'מ': 'î','נ': 'ð', 'ס': 'ñ', 'ע': 'ò', 'פ': 'ô', 'צ': 'ö', 'ק': '÷', 'ר': 'ø', 'ש': 'ù', 'ת': 'ú', 'ך': 'ê', 'ם': 'í', 'ן': 'ï', 'ף': 'ó', 'ץ': 'õ'}
    jib_to_heb = {'à': 'א', 'á': 'ב', 'â': 'ג', 'ã': 'ד', 'ä': 'ה', 'å': 'ו', 'æ': 'ז', 'ç': 'ח', 'è': 'ט', 'é': 'י', 'ë': 'כ', 'ì': 'ל', 'î': 'מ', 'ð': 'נ', 'ñ': 'ס', 'ò': 'ע', 'ô': 'פ', 'ö': 'צ', '÷': 'ק', 'ø': 'ר', 'ù': 'ש', 'ú': 'ת', 'ê': 'ך', 'í': 'ם', 'ï': 'ן', 'ó': 'ף', 'õ': 'ץ'}

    # הגדרת מחרוזת ריקה למילוי אוטומטי בהמשך
    new_string = ""
    
    # בדיקה של סוג המחרוזת
    if any(c in "אבגדהוזחטיכלמנסעפצקרשתךםןףץ" for c in string):
        setting = "jib"
    elif any(c in "àáâãäåæçèéëìîðñòôö÷øùúêíïóõ" for c in string):
        setting = "heb"
        
    # מעבר על המחרוזת שהוזנה והמרה שלה, אות אחר אות
    for letter in string:
        # דילוג אם האות הנוכחית היא רווח
        if letter == " ":
            new_string = new_string + " "
        elif setting == "heb":
            try:
                new_letter = jib_to_heb[letter]
                new_string = new_string + new_letter
            except:
                pass
        elif setting == "jib":
            try:
                new_letter = heb_to_jib[letter]
                new_string = new_string + new_letter
            except:
                pass
            
    return new_string


def main():
    string = "þþàìáåí ìà éãåò"
    print(jibrish_to_hebrew(string))

if __name__ == '__main__':
    main()
    

